{"data":{"user":{"name":"Sachin Maharana","lastActive":"10/2017","friendsNo":"31","reviewsCount":"146","userShelves":{"read":"60","currentlyReading":"5","toRead":"81"},"userStatus":[{"percentRead":"28","book":{"title":"The Grace of Kings (The Dandelion Dynasty, #1)","numPages":"623","authors":"Ken Liu"}},{"percentRead":"48","book":{"title":"Paternus (Paternus, #1)","numPages":"464","authors":"Dyrk Ashton"}},{"percentRead":"41","book":{"title":"Norse Mythology","numPages":"297","authors":"Neil Gaiman"}}],"read":[{"book":{"id":"6285903","imageUrl":"./images/6285903.jpg","title":"Retribution Falls (Tales of the Ketty Jay, #1)","numOfPages":"380","authors":"Chris Wooding","link":"https://www.goodreads.com/book/show/6285903-retribution-falls","publicationYear":"2009","averageRating":"3.98","ratingCount":"7156","description":"Sky piracy is a bit out of Darian Frey’s league. Fate has not been kind to the captain of the airship Ketty Jay—or his motley crew. They are all running from something. Crake is a daemonist in hiding, traveling with an armored golem and burdened by guilt. Jez is the new navigator, desperate to keep her secret from the rest of the crew. Malvery is a disgraced doctor, drinking himself to death. So when an opportunity arises to steal a chest of gems from a vulnerable airship, Frey can’t pass it up. It’s an easy take—and the payoff will finally make him a rich man.<br /><br />But when the attack goes horribly wrong, Frey suddenly finds himself the most wanted man in Vardia, trailed by bounty hunters, the elite Century Knights, and the dread queen of the skies, Trinica Dracken. Frey realizes that they’ve been set up to take a fall but doesn’t know the endgame. And the ultimate answer for captain and crew may lie in the legendary hidden pirate town of Retribution Falls. That’s if they can get there without getting blown out of the sky."}},{"book":{"id":"11777020","imageUrl":"./images/11777020.jpg","title":"Headhunters","numOfPages":"265","authors":"Jo Nesbø","link":"https://www.goodreads.com/book/show/11777020-headhunters","publicationYear":"2011","averageRating":"3.79","ratingCount":"22781","description":"Roger Brown is a corporate headhunter, and he’s a master of his profession. But one career simply can’t support his luxurious lifestyle and his wife’s fledgling art gallery. At an art opening one night he meets Clas Greve, who is not only the perfect candidate for a major CEO job, but also, perhaps, the answer to his financial woes: Greve just so happens to mention that he owns a priceless Peter Paul Rubens painting that’s been lost since World War II—and Roger Brown just so happens to dabble in art theft. But when he breaks into Greve’s apartment, he finds more than just the painting. And Clas Greve may turn out to be the worst thing that’s ever happened to Roger Brown."}},{"book":{"id":"91479","imageUrl":"./images/91479.jpg","title":"Death Masks (The Dresden Files, #5)","numOfPages":"432","authors":"Jim Butcher","link":"https://www.goodreads.com/book/show/91479.Death_Masks","publicationYear":"2003","averageRating":"4.32","ratingCount":"92304","description":"Harry Dresden, Chicago's only practicing professional wizard, should be happy that business is pretty good for a change. But now he's getting more than he bargained for:<br /><br />A duel with the Red Court of Vampires' champion, who must kill Harry to end the war between vampires and wizards...<br /><br />Professional hit men using Harry for target practice...<br /><br />The missing Shroud of Turin...<br /><br />A handless and headless corpse the Chicago police need identified...<br /><br />Not to mention the return of Harry's ex-girlfriend Susan, who's still struggling with her semi-vampiric nature. And who seems to have a new man in her life.<br /><br />Some days, it just doesn't pay to get out of bed. No matter how much you're charging."}},{"book":{"id":"303110","imageUrl":"./images/303110.jpg","title":"Earthcore","numOfPages":"","authors":"Scott Sigler","link":"https://www.goodreads.com/book/show/303110.Earthcore","publicationYear":"","averageRating":"4.16","ratingCount":"3512","description":"Deep below a desolate Utah mountain lies the largest platinum deposit ever discovered. A billion-dollar find, it waits for any company that can drill a world's record, three-mile-deep mine shaft. EarthCore is the company with the technology, the resources and the guts to go after the mother lode. Young executive Connell Kirkland is the company's driving force, pushing himself and those around him to uncover the massive treasure. But at three miles below the surface, where the rocks are so hot they burn bare skin, something has been waiting for centuries. Waiting ...and guarding. Kirkland and EarthCore are about to find out first-hand why this treasure has never been unearthed."}},{"book":{"id":"34091380","imageUrl":"./images/34091380.jpg","title":"The Late Show (Renée Ballard, #1)","numOfPages":"405","authors":"Michael Connelly","link":"https://www.goodreads.com/book/show/34091380-the-late-show","publicationYear":"2017","averageRating":"4.08","ratingCount":"15944","description":"From #1 New York Times bestselling author Michael Connelly, a new thriller introducing a driven young detective trying to prove herself in the LAPD<br /><br />Renée Ballard works the night shift in Hollywood, beginning many investigations but finishing none as each morning she turns her cases over to day shift detectives. A once up-and-coming detective, she's been given this beat as punishment after filing a sexual harassment complaint against a supervisor.<br /><br />But one night she catches two cases she doesn't want to part with: the brutal beating of a prostitute left for dead in a parking lot and the killing of a young woman in a nightclub shooting. Ballard is determined not to give up at dawn. Against orders and her own partner's wishes, she works both cases by day while maintaining her shift by night. As the cases entwine they pull her closer to her own demons and the reason she won't give up her job no matter what the department throws at her."}},{"book":{"id":"77197","imageUrl":"./images/77197.jpg","title":"Assassin's Apprentice (Farseer Trilogy, #1)","numOfPages":"448","authors":"Robin Hobb","link":"https://www.goodreads.com/book/show/77197.Assassin_s_Apprentice","publicationYear":"1996","averageRating":"4.14","ratingCount":"167574","description":"<i>Alternate cover edition for this ISBN can be found <a href=\"https://www.goodreads.com/book/show/34399908-assassin-s-apprentice\" rel=\"nofollow\">here</a></i>.<br /><br />Young Fitz is the bastard son of the noble Prince Chivalry, raised in the shadow of the royal court by his father’s gruff stableman. He is treated as an outcast by all the royalty except the devious King Shrewd, who has him secretly tutored in the arts of the assassin. For in Fitz’s blood runs the magic Skill—and the darker knowledge of a child raised with the stable hounds and rejected by his family.<br /><br />As barbarous raiders ravage the coasts, Fitz is growing to manhood. Soon he will face his first dangerous, soul-shattering mission. And though some regard him as a threat to the throne, he may just be the key to the survival of the kingdom."}},{"book":{"id":"25300956","imageUrl":"./images/25300956.jpg","title":"Royal Assassin (Farseer Trilogy, #2)","numOfPages":"675","authors":"Robin Hobb","link":"https://www.goodreads.com/book/show/25300956-royal-assassin","publicationYear":"2002","averageRating":"4.21","ratingCount":"105245","description":"Fitz has survived his first hazardous mission as king’s assassin, but is left little more than a cripple. Battered and bitter, he vows to abandon his oath to King Shrewd, remaining in the distant mountains. But love and events of terrible urgency draw him back to the court at Buckkeep, and into the deadly intrigues of the royal family.<br /><br />Renewing their vicious attacks on the coast, the Red-Ship Raiders leave burned-out villages and demented victims in their wake. The kingdom is also under assault from within, as treachery threatens the throne of the ailing king. In this time of great danger, the fate of the kingdom may rest in Fitz’s hands—and his role in its salvation may require the ultimate sacrifice."}},{"book":{"id":"26245853","imageUrl":"./images/26245853.jpg","title":"The Last Mile (Amos Decker, #2)","numOfPages":"644","authors":"David Baldacci","link":"https://www.goodreads.com/book/show/26245853-the-last-mile","publicationYear":"2016","averageRating":"4.22","ratingCount":"36989","description":"<b>\n  <blockquote>In his #1 <i>New York Times </i>bestseller <i>Memory Man</i>, David Baldacci introduced the extraordinary detective Amos Decker-the man who can forget nothing. Now, Decker returns in a spectacular new thriller . . . <i>The Last Mile</i></blockquote>\n</b>Convicted murderer Melvin Mars is counting down the last hours before his execution--for the violent killing of his parents twenty years earlier--when he's granted an unexpected reprieve. Another man has confessed to the crime.<p>Amos Decker, newly hired on an FBI special task force, takes an interest in Mars's case after discovering the striking similarities to his own life: Both men were talented football players with promising careers cut short by tragedy. Both men's families were brutally murdered. And in both cases, another suspect came forward, years after the killing, to confess to the crime. A suspect who may or may not have been telling the truth.</p><p>The confession has the potential to make Melvin Mars--guilty or not--a free man. Who wants Mars out of prison? And why now?</p><p>But when a member of Decker's team disappears, it becomes clear that something much larger--and more sinister--than just one convicted criminal's life hangs in the balance. Decker will need all of his extraordinary brainpower to stop an innocent man from being executed.</p><p><b>\"Entertaining and enlightening, The Last Mile is a rich novel that has much to offer...In the best Baldacci tradition, the action is fast and furious. But <i>The Last Mile</i> is more than a good action thriller. It sheds light on racism, a father-son relationship and capital punishment. Both Mars and Decker are substantive, solid characters....Utterly absorbing.\"</b>—<i>Associated Press</i></p><p><b>\"[Amos Decker is] one of the most unique protagonists seen in thriller fiction....David Baldacci has always been a top-notch thriller writer ...[his] fertile imagination and intricate plotting abilities make each of his books a treat for thriller readers. <i>The Last Mile</i> is no exception.\"</b>—<i>BookReporter.com</i></p><p><b>\"The intricate details in Baldacci's explosive new novel engage until the final word. He's hit the pinnacle traveling the Deep South and exploring its traditions. Decker and his compatriots are characters to remember long after reading this impressive undertaking.\"</b>—<i>RT Book Reviews</i> (4 1/2 stars - Top Pick!)</p><p><b>\"A compelling mystery with emotional resonance. Just when the story line heads to what seems an obvious conclusion, Baldacci veers off course with a surprising twist. The end result is another exciting read from a thriller master.\"</b>—<i>Library Journal</i> (Starred Review)</p><p><b>\"Baldacci excels at developing interesting, three-dimensional protagonists...Baldacci fans will not be disappointed, and <i>The Last Mile</i> gives good reason to look forward to the next Amos Decker thriller.\"</b>—<i>New York Journal of Books</i></p><p><b>\"It's big, bold and almost impossible to put down...Decker is one of the most unusual detectives any novelist has dreamed up...I called this novel a master class on the bestseller because of its fast-moving narrative, the originality of its hero and its irresistible plot....Highly entertaining.\"</b>—<i>Washington Post</i> on <i>Memory Man</i></p><p><b>\"David Baldacci has written another thriller that will have readers engaged from the first page....Baldacci is a master storyteller...<i>Memory Man</i> works because Amos Decker is an amazing character. Reading how Decker journeys from hitting rock bottom to finding ultimate redemption is nothing short of rewarding.\"</b>—<i>Associated Press</i> on <i>Memory Man</i></p><p><b>\"Perennial bestseller Baldacci unveils an offbeat hero with an unusual skill set and tragic past who takes on the evil mastermind behind a devastating school shooting..[Decker] proves a quirky, original antihero with a definite method to his madness...Readers will want to see Decker back on the printed page again and again.\"</b>—<i>Kirkus Reviews</i> on <i>Memory Man</i></p>"}},{"book":{"id":"30078567","imageUrl":"./images/30078567.jpg","title":"The Collapsing Empire (The Interdependency #1)","numOfPages":"336","authors":"John Scalzi","link":"https://www.goodreads.com/book/show/30078567-the-collapsing-empire","publicationYear":"2017","averageRating":"4.11","ratingCount":"11042","description":"The first novel of a new space-opera sequence set in an all-new universe by the Hugo Award-winning, New York Times-bestselling author of Redshirts and Old Man's War.<br /><br />Our universe is ruled by physics and faster than light travel is not possible -- until the discovery of The Flow, an extra-dimensional field we can access at certain points in space-time that transport us to other worlds, around other stars. <br /><br />Humanity flows away from Earth, into space, and in time forgets our home world and creates a new empire, the Interdependency, whose ethos requires that no one human outpost can survive without the others. It’s a hedge against interstellar war -- and a system of control for the rulers of the empire.<br /><br />The Flow is eternal -- but it is not static. Just as a river changes course, The Flow changes as well, cutting off worlds from the rest of humanity. When it’s discovered that The Flow is moving, possibly cutting off all human worlds from faster than light travel forever, three individuals -- a scientist, a starship captain and the Empress of the Interdependency -- are in a race against time to discover what, if anything, can be salvaged from an interstellar empire on the brink of collapse."}},{"book":{"id":"24611449","imageUrl":"./images/24611449.jpg","title":"Back Blast (Gray Man, #5)","numOfPages":"512","authors":"Mark Greaney","link":"https://www.goodreads.com/book/show/24611449-back-blast","publicationYear":"","averageRating":"4.46","ratingCount":"3923","description":"<blockquote>\n  <b>From the #1 <i>New York Times </i>bestselling co-author of Tom Clancy’s Jack Ryan novels, comes an all-new explosive thriller featuring the lethal assassin known as the Gray Man…</b>\n</blockquote>Court Gentry was the CIA’s best agent. Until the day the Agency turned against him and put out a kill on sight order. That’s when the enigmatic international assassin called the Gray Man was born—and Court has been working for himself ever since<p>Now, Court is back in Washington looking for answers. He’s determined to find out what happened all those years ago that made the Agency turn against him. On his list to interrogate are his former partners and the men who sent him on his last mission. What he doesn’t realize is that the questions that arose from that mission are still reverberating in the U.S. intelligence community, and he’s stumbled onto a secret that powerful people want kept under wraps. And now, they have Court in their crosshairs.</p><p>Court Gentry is used to having people on his trail, but this time, it’s on U.S. soil—the last place he wants to be. Now, he’ll have to find the answers to his fate while evading capture…and avoiding death.</p><p><b>“Take fictional spy Jason Bourne, pump him up with Red Bull and meth, shake vigorously—and you’ve got the recipe for Court Gentry.</b>”—<i>The Memphis Commercial Appeal</i></p><p><b>“The story is so propulsive, the murders so explosive, that flipping the pages feels like playing the ultimate video game.”</b>—<i>The New York Times</i></p><p><b>“Hard, fast, and unflinching.”</b>—Lee Child, #1 <i>New York Times</i> bestselling author of <i>A Wanted Man</i></p>"}},{"book":{"id":"6547865","imageUrl":"./images/6547865.jpg","title":"The Gray Man (Gray Man, #1)","numOfPages":"456","authors":"Mark Greaney","link":"https://www.goodreads.com/book/show/6547865-the-gray-man","publicationYear":"2009","averageRating":"4.08","ratingCount":"9183","description":"To those who lurk in the shadows, he’s known as the Gray Man. He is a legend in the covert realm, moving silently from job to job, accomplishing the impossible and then fading away. And he always hits his target. Always.<p>But there are forces more lethal than Gentry in the world. Forces like money. And power. And there are men who hold these as the only currency worth fighting for. And in their eyes, Gentry has just outlived his usefulness.</p><p>But Court Gentry is going to prove that, for him, there’s no gray area between killing for a living and killing to stay alive…</p>"}},{"book":{"id":"19486412","imageUrl":"./images/19486412.jpg","title":"Big Little Lies","numOfPages":"460","authors":"Liane Moriarty","link":"https://www.goodreads.com/book/show/19486412-big-little-lies","publicationYear":"2014","averageRating":"4.21","ratingCount":"397824","description":"<i>Big Little Lies</i> follows three women, each at a crossroads:<br /><br />Madeline is a force to be reckoned with. She’s funny and biting, passionate, she remembers everything and forgives no one. Her ex-husband and his yogi new wife have moved into her beloved beachside community, and their daughter is in the same kindergarten class as Madeline’s youngest (<i>how </i>is this possible?). And to top it all off, Madeline’s teenage daughter seems to be choosing Madeline’s ex-husband over her. (How. Is. This. Possible?).<br /><br />Celeste is the kind of beautiful woman who makes the world stop and stare. While she may seem a bit flustered at times, who wouldn’t be, with those rambunctious twin boys? Now that the boys are starting school, Celeste and her husband look set to become the king and queen of the school parent body. But royalty often comes at a price, and Celeste is grappling with how much more she is willing to pay.<br /><br />New to town, single mom Jane is so young that another mother mistakes her for the nanny. Jane is sad beyond her years and harbors secret doubts about her son. But why? While Madeline and Celeste soon take Jane under their wing, none of them realizes how the arrival of Jane and her inscrutable little boy will affect them all.<br /><br /><i>Big Little Lies</i> is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive."}},{"book":{"id":"31176804","imageUrl":"./images/31176804.jpg","title":"Snapshot","numOfPages":"123","authors":"Brandon Sanderson","link":"https://www.goodreads.com/book/show/31176804-snapshot","publicationYear":"2017","averageRating":"4.04","ratingCount":"5830","description":"Snapshot is a Science Fiction detective story following Anthony Davis, a cop assigned to Snapshot Duty. In this vivid world that author Brandon Sanderson has built, society can create a snapshot of a specific day in time. The experiences people have, the paths they follow—all of them are real again for a one day in the snapshot. All for the purposes of investigation by the court. <br /><br />Davis’s job as a cop on Snapshot Duty is straight forward. Sometimes he is tasked with finding where a criminal dumped a weapon. Sometimes he is tasked with documenting domestic disputes. Simple. Mundane. One day, in between two snapshot assignments, Davis decides to investigate the memory of a call that was mysteriously never logged at the precinct, and he makes a horrifying discovery.<br /><br />As in all many stories, Snapshot follows a wonderfully flawed character as he attempts to solve a horrific crime. Sanderson proves that no matter the genre, he is one of the most skilled storytellers in the business."}},{"book":{"id":"18947303","imageUrl":"./images/18947303.jpg","title":"Traitor's Blade (Greatcoats, #1)","numOfPages":"370","authors":"Sebastien de Castell","link":"https://www.goodreads.com/book/show/18947303-traitor-s-blade","publicationYear":"2014","averageRating":"4.08","ratingCount":"9693","description":"Falcio is the first Cantor of the Greatcoats. Trained in the fighting arts and the laws of Tristia, the Greatcoats are travelling Magisters upholding King’s Law. They are heroes. Or at least they were, until they stood aside while the Dukes took the kingdom, and impaled their King’s head on a spike.<br /><br />Now Tristia is on the verge of collapse and the barbarians are sniffing at the borders. The Dukes bring chaos to the land, while the Greatcoats are scattered far and wide, reviled as traitors, their legendary coats in tatters.<br /><br />All they have left are the promises they made to King Paelis, to carry out one final mission. But if they have any hope of fulfilling the King’s dream, the divided Greatcoats must reunite, or they will also have to stand aside as they watch their world burn…"}},{"book":{"id":"25489134","imageUrl":"./images/25489134.jpg","title":"The Bear and the Nightingale (The Winternight Trilogy #1)","numOfPages":"322","authors":"Katherine  Arden","link":"https://www.goodreads.com/book/show/25489134-the-bear-and-the-nightingale","publicationYear":"2017","averageRating":"4.13","ratingCount":"17150","description":"At the edge of the Russian wilderness, winter lasts most of the year and the snowdrifts grow taller than houses. But Vasilisa doesn’t mind—she spends the winter nights huddled around the embers of a fire with her beloved siblings, listening to her nurse’s fairy tales. Above all, she loves the chilling story of Frost, the blue-eyed winter demon, who appears in the frigid night to claim unwary souls. Wise Russians fear him, her nurse says, and honor the spirits of house and yard and forest that protect their homes from evil.<br /><br />After Vasilisa’s mother dies, her father goes to Moscow and brings home a new wife. Fiercely devout, city-bred, Vasilisa’s new stepmother forbids her family from honoring the household spirits. The family acquiesces, but Vasilisa is frightened, sensing that more hinges upon their rituals than anyone knows.<br /><br />And indeed, crops begin to fail, evil creatures of the forest creep nearer, and misfortune stalks the village. All the while, Vasilisa’s stepmother grows ever harsher in her determination to groom her rebellious stepdaughter for either marriage or confinement in a convent.<br /><br />As danger circles, Vasilisa must defy even the people she loves and call on dangerous gifts she has long concealed—this, in order to protect her family from a threat that seems to have stepped from her nurse’s most frightening tales."}},{"book":{"id":"13578175","imageUrl":"./images/13578175.jpg","title":"The Emperor's Soul","numOfPages":"175","authors":"Brandon Sanderson","link":"https://www.goodreads.com/book/show/13578175-the-emperor-s-soul","publicationYear":"2012","averageRating":"4.33","ratingCount":"40667","description":"Also available in <a href=\"https://www.goodreads.com/book/show/28595941.Arcanum_Unbounded__The_Cosmere_Collection\" title=\"Arcanum Unbounded: The Cosmere Collection\" rel=\"nofollow\">Arcanum Unbounded: The Cosmere Collection</a>.<br /><br />A heretic thief is the empire’s only hope in this fascinating tale that inhabits the same world as the popular novel, <i>Elantris</i>.<br /><br />Shai is a Forger, a foreigner who can flawlessly copy and re-create any item by rewriting its history with skillful magic. Condemned to death after trying to steal the emperor’s scepter, she is given one opportunity to save herself. Though her skill as a Forger is considered an abomination by her captors, Shai will attempt to create a new soul for the emperor, who is almost dead. <br /><br />Probing deeply into his life, she discovers Emperor Ashravan’s truest nature—and the opportunity to exploit it. Her only possible ally is one who is truly loyal to the emperor, but councilor Gaotona must overcome his prejudices to understand that Shai’s forgery is as much artistry as it is deception. <br /><br />Brimming with magic and political intrigue, this deftly woven fantasy delves into the essence of a living spirit."}},{"book":{"id":"26892110","imageUrl":"./images/26892110.jpg","title":"The Library at Mount Char","numOfPages":"388","authors":"Scott  Hawkins","link":"https://www.goodreads.com/book/show/26892110-the-library-at-mount-char","publicationYear":"2016","averageRating":"4.07","ratingCount":"16947","description":"<i>A missing God.</i><br /><i>A library with the secrets to the universe. </i><br /><i>A woman too busy to notice her heart slipping away.</i><br /><i> </i><br /> Carolyn's not so different from the other people around her. She likes guacamole and cigarettes and steak. She knows how to use a phone. Clothes are a bit tricky, but everyone says nice things about her outfit with the Christmas sweater over the gold bicycle shorts.  <br /><br />After all, she was a normal American herself once.   <br /><br />That was a long time ago, of course. Before her parents died. Before she and the others were taken in by the man they called Father. <br /><br />In the years since then, Carolyn hasn't had a chance to get out much. Instead, she and her adopted siblings have been raised according to Father's ancient customs. They've studied the books in his Library and learned some of the secrets of his power. And sometimes, they've wondered if their cruel tutor might secretly be God.  <br /><br />Now, Father is missing—perhaps even dead—and the Library that holds his secrets stands unguarded. And with it, control over all of creation. <br /><br />As Carolyn gathers the tools she needs for the battle to come, fierce competitors for this prize align against her, all of them with powers that far exceed her own. <br /><br />But Carolyn has accounted for this. <br /><br />And Carolyn has a plan. <br /><br />The only trouble is that in the war to make a new God, she's forgotten to protect the things that make her human.<br /><br />Populated by an unforgettable cast of characters and propelled by a plot that will shock you again and again, <i>The Library at Mount Char</i> is at once horrifying and hilarious, mind-blowingly alien and heartbreakingly human, sweepingly visionary and nail-bitingly thrilling—and signals the arrival of a major new voice in fantasy.<br /><br /><br /><i>From the Hardcover edition.</i>"}},{"book":{"id":"25372801","imageUrl":"./images/25372801.jpg","title":"All the Birds in the Sky","numOfPages":"320","authors":"Charlie Jane Anders","link":"https://www.goodreads.com/book/show/25372801-all-the-birds-in-the-sky","publicationYear":"2016","averageRating":"3.58","ratingCount":"20155","description":"<b>A novel about the end of the world--and the beginning of our future</b><br /><br />Childhood friends Patricia Delfine and Laurence Armstead didn't expect to see each other again, after parting ways under mysterious circumstances during high school. After all, the development of magical powers and the invention of a two-second time machine could hardly fail to alarm one's peers and families.<br /><br />But now they're both adults, living in the hipster mecca of San Francisco, and the planet is falling apart around them. Laurence is an engineering genius who's working with a group that aims to avert catastrophic breakdown through technological intervention into the changing global climate. Patricia is a graduate of Eltisley Maze, the hidden academy for the world's magically gifted, and works with a small band of other magicians to secretly repair the world's ever-growing ailments. Little do they realize that something bigger than either of them, something begun years ago in their youth, is determined to bring them together--to either save the world, or plunge it into a new dark ages.<br /><br />A deeply magical, darkly funny examination of life, love, and the apocalypse."}},{"book":{"id":"27833670","imageUrl":"./images/27833670.jpg","title":"Dark Matter","numOfPages":"342","authors":"Blake Crouch","link":"https://www.goodreads.com/book/show/27833670-dark-matter","publicationYear":"2016","averageRating":"4.10","ratingCount":"92511","description":"“Are you happy with your life?” <br /><br />Those are the last words Jason Dessen hears before the masked abductor knocks him unconscious. <br /><br />Before he awakens to find himself strapped to a gurney, surrounded by strangers in hazmat suits. <br /><br />Before a man Jason’s never met smiles down at him and says, “Welcome back, my friend.” <br /><br />In this world he’s woken up to, Jason’s life is not the one he knows. His wife is not his wife. His son was never born. And Jason is not an ordinary college physics professor, but a celebrated genius who has achieved something remarkable. Something impossible.<br /><br />Is it this world or the other that’s the dream? And even if the home he remembers is real, how can Jason possibly make it back to the family he loves? The answers lie in a journey more wondrous and horrifying than anything he could’ve imagined—one that will force him to confront the darkest parts of himself even as he battles a terrifying, seemingly unbeatable foe.<br /><br />From the author of the bestselling Wayward Pines trilogy, Dark Matter is a brilliantly plotted tale that is at once sweeping and intimate, mind-bendingly strange and profoundly human—a relentlessly surprising science-fiction thriller about choices, paths not taken, and how far we’ll go to claim the lives we dream of."}},{"book":{"id":"28077464","imageUrl":"./images/28077464.jpg","title":"Night School (Jack Reacher #21)","numOfPages":"14","authors":"Lee Child","link":"https://www.goodreads.com/book/show/28077464-night-school","publicationYear":"2016","averageRating":"3.96","ratingCount":"30332","description":"It’s 1996, and Reacher is still in the army. In the morning they give him a medal, and in the afternoon they send him back to school. That night he’s off the grid. Out of sight, out of mind.<br /><br />Two other men are in the classroom—an FBI agent and a CIA analyst. Each is a first-rate operator, each is fresh off a big win, and each is wondering what the hell they are doing there.<br /><br />Then they find out: A Jihadist sleeper cell in Hamburg, Germany, has received an unexpected visitor—a Saudi courier, seeking safe haven while waiting to rendezvous with persons unknown. A CIA asset, undercover inside the cell, has overheard the courier whisper a chilling message: “The American wants a hundred million dollars.”<br /><br />For what? And who from? Reacher and his two new friends are told to find the American. Reacher recruits the best soldier he has ever worked with: Sergeant Frances Neagley. Their mission heats up in more ways than one, while always keeping their eyes on the prize: If they don’t get their man, the world will suffer an epic act of terrorism.<br /><br />From Langley to Hamburg, Jalalabad to Kiev, <i>Night School</i> moves like a bullet through a treacherous landscape of double crosses, faked identities, and new and terrible enemies, as Reacher maneuvers inside the game and outside the law.<br /><br /><i>Listening Length: 13 hours and 7 minutes</i>"}},{"book":{"id":"25558608","imageUrl":"./images/25558608.jpg","title":"A Torch Against the Night (An Ember in the Ashes, #2)","numOfPages":"452","authors":"Sabaa Tahir","link":"https://www.goodreads.com/book/show/25558608-a-torch-against-the-night","publicationYear":"2016","averageRating":"4.34","ratingCount":"37901","description":"Elias and Laia are running for their lives. After the events of the Fourth Trial, Martial soldiers hunt the two fugitives as they flee the city of Serra and undertake a perilous journey through the heart of the Empire.<br /><br />Laia is determined to break into Kauf—the Empire’s most secure and dangerous prison—to save her brother, who is the key to the Scholars’ survival. And Elias is determined to help Laia succeed, even if it means giving up his last chance at freedom.<br /><br />But dark forces, human and otherworldly, work against Laia and Elias. The pair must fight every step of the way to outsmart their enemies: the bloodthirsty Emperor Marcus, the merciless Commandant, the sadistic Warden of Kauf, and, most heartbreaking of all, Helene—Elias’s former friend and the Empire’s newest Blood Shrike.<br /><br />Bound to Marcus’s will, Helene faces a torturous mission of her own—one that might destroy her: find the traitor Elias Veturius and the Scholar slave who helped him escape…and kill them both."}},{"book":{"id":"28251002","imageUrl":"./images/28251002.jpg","title":"The Nix","numOfPages":"628","authors":"Nathan  Hill","link":"https://www.goodreads.com/book/show/28251002-the-nix","publicationYear":"2016","averageRating":"4.12","ratingCount":"29355","description":"A hilarious and deeply touching debut novel about a son, the mother who left him as a child, and how his search to uncover the secrets of her life leads him to reclaim his own.<br /><br />Meet Samuel Andresen-Anderson: stalled writer, bored teacher at a local college, obsessive player of an online video game. He hasn't seen his mother, Faye, since she walked out when he was a child. But then one day there she is, all over the news, throwing rocks at a presidential candidate. The media paints Faye as a militant radical with a sordid past, but as far as Samuel knows, his mother never left her small Iowa town. Which version of his mother is the true one? Determined to solve the puzzle - and finally have something to deliver to his publisher - Samuel decides to capitalize on his mother's new fame by writing a tell-all biography, a book that will savage her intimately, publicly. But first, he has to locate her; and second, to talk to her without bursting into tears. <br /><br />As Samuel begins to excavate her history, the story moves from the rural Midwest of the 1960s to New York City during the Great Recession and Occupy Wall Street to the infamous riots at the 1968 Chicago Democratic National Convention, and finally to Norway, home of the mysterious Nix that his mother told him about as a child. And in these places, Samuel will unexpectedly find that he has to rethink everything he ever knew about his mother - a woman with an epic story of her own, a story she kept hidden from the world."}},{"book":{"id":"29430012","imageUrl":"./images/29430012.jpg","title":"A Gentleman in Moscow","numOfPages":"462","authors":"Amor Towles","link":"https://www.goodreads.com/book/show/29430012-a-gentleman-in-moscow","publicationYear":"2016","averageRating":"4.37","ratingCount":"57798","description":"<b>From the <i>New York Times</i> bestselling author of <i><a href=\"https://www.goodreads.com/book/show/10054335.Rules_of_Civility\" title=\"Rules of Civility\" rel=\"nofollow\">Rules of Civility</a></i>—a transporting novel about a man who is ordered to spend the rest of his life inside a luxury hotel </b><br />  <br /> With his breakout debut novel, <i>\n  <a href=\"https://www.goodreads.com/book/show/10054335.Rules_of_Civility\" title=\"Rules of Civility\" rel=\"nofollow\">Rules of Civility</a>\n</i>, Amor Towles established himself as a master of absorbing, sophisticated fiction, bringing late 1930s Manhattan to life with splendid atmosphere and a flawless command of style. <br /><i><br /> A Gentleman in Moscow</i> immerses us in another elegantly drawn era with the story of Count Alexander Rostov. When, in 1922, he is deemed an unrepentant aristocrat by a Bolshevik tribunal, the count is sentenced to house arrest in the Metropol, a grand hotel across the street from the Kremlin. Rostov, an indomitable man of erudition and wit, has never worked a day in his life, and must now live in an attic room while some of the most tumultuous decades in Russian history are unfolding outside the hotel’s doors. Unexpectedly, his reduced circumstances provide him a doorway into a much larger world of emotional discovery.<br /><br /> Brimming with humor, a glittering cast of characters, and one beautifully rendered scene after another, this singular novel casts a spell as it relates the count’s endeavor to gain a deeper understanding of what it means to be a man of purpose."}},{"book":{"id":"29430007","imageUrl":"./images/29430007.jpg","title":"Home (Myron Bolitar #11)","numOfPages":"387","authors":"Harlan Coben","link":"https://www.goodreads.com/book/show/29430007-home","publicationYear":"2016","averageRating":"4.20","ratingCount":"24658","description":"<b>Ten years after the high-profile kidnapping of two young boys, only one returns home.</b><br /><br />A decade ago, kidnappers grabbed two boys from wealthy families and demanded ransom, then went silent. No trace of the boys ever surfaced. For ten years their families have been left with nothing but painful memories and a quiet desperation for the day that has finally, miraculously arrived: Myron Bolitar and his friend Win believe they have located one of the boys, now a teenager. Where has he been for ten years, and what does he know about the day, more than half a life ago, when he was taken? And most critically: What can he tell Myron and Win about the fate of his missing friend? <br /><br />Harlan Coben delivers a thriller about friendship, family, and the meaning of home."}},{"book":{"id":"27774758","imageUrl":"./images/27774758.jpg","title":"An Ember in the Ashes (An Ember in the Ashes, #1)","numOfPages":"446","authors":"Sabaa Tahir","link":"https://www.goodreads.com/book/show/27774758-an-ember-in-the-ashes","publicationYear":"2016","averageRating":"4.32","ratingCount":"99133","description":"<i>Alternative cover edition for ISBN-13: <a href=\"https://www.goodreads.com/book/show/36040400-an-ember-in-the-ashes\" rel=\"nofollow\">9781595148049</a>.</i><br /><br />Laia is a slave. Elias is a soldier. Neither is free.<br />  <br /> Under the Martial Empire, defiance is met with death. Those who do not vow their blood and bodies to the Emperor risk the execution of their loved ones and the destruction of all they hold dear.<br />  <br /> It is in this brutal world, inspired by ancient Rome, that Laia lives with her grandparents and older brother. The family ekes out an existence in the Empire’s impoverished backstreets. They do not challenge the Empire. They’ve seen what happens to those who do.<br />  <br /> But when Laia’s brother is arrested for treason, Laia is forced to make a decision. In exchange for help from rebels who promise to rescue her brother, she will risk her life to spy for them from within the Empire’s greatest military academy.<br />  <br /> There, Laia meets Elias, the school’s finest soldier—and secretly, its most unwilling. Elias wants only to be free of the tyranny he’s being trained to enforce. He and Laia will soon realize that their destinies are intertwined—and that their choices will change the fate of the Empire itself.<br /><br /><i>From the Hardcover edition.</i>"}},{"book":{"id":"27213121","imageUrl":"./images/27213121.jpg","title":"The Black Widow (Gabriel Allon, #16)","numOfPages":"528","authors":"Daniel Silva","link":"https://www.goodreads.com/book/show/27213121-the-black-widow","publicationYear":"2016","averageRating":"4.33","ratingCount":"18136","description":"A network of terror.<br />A web of deceit.<br />A deadly game of vengeance.<br /><br />Legendary spy and art restorer Gabriel Allon is poised to become the chief of Israel’s secret intelligence service. But on the eve of his promotion, events conspire to lure him into the field for one final operation. ISIS has detonated a massive bomb in the Marais district of Paris, and a desperate French government wants Gabriel to eliminate the man responsible before he can strike again.<br /><br />They call him Saladin …<br /><br />He is a terrorist mastermind whose ambition is as grandiose as his nom de guerre, a man so elusive that even his nationality is not known. Shielded by sophisticated encryption software, his network communicates in total secrecy, leaving the West blind to his planning—and leaving Gabriel no choice but to insert an agent into the most dangerous terrorist group the world has ever known. Natalie Mizrahi is an extraordinary young doctor as brave as she is beautiful. At Gabriel’s behest, she will pose as an ISIS recruit in waiting, a ticking time bomb, a black widow out for blood.<br /><br />Her perilous mission will take her from the restive suburbs of Paris to the island of Santorini and the brutal world of the Islamic State’s new caliphate, and eventually to Washington, D.C., where the ruthless Saladin is plotting an apocalyptic night of terror that will alter the course of history. The Black Widow is a riveting thriller of shocking prescience. But it is also a thoughtful journey into the new heart of darkness that will haunt readers long after they have turned the final page."}},{"book":{"id":"27071490","imageUrl":"./images/27071490.jpg","title":"Homegoing","numOfPages":"305","authors":"Yaa Gyasi","link":"https://www.goodreads.com/book/show/27071490-homegoing","publicationYear":"2016","averageRating":"4.41","ratingCount":"57397","description":"A novel of breathtaking sweep and emotional power that traces three hundred years in Ghana and along the way also becomes a truly great American novel. Extraordinary for its exquisite language, its implacable sorrow, its soaring beauty, and for its monumental portrait of the forces that shape families and nations, Homegoing heralds the arrival of a major new voice in contemporary fiction.<br /><br />Two half-sisters, Effia and Esi, are born into different villages in eighteenth-century Ghana. Effia is married off to an Englishman and lives in comfort in the palatial rooms of Cape Coast Castle. Unbeknownst to Effia, her sister, Esi, is imprisoned beneath her in the castle's dungeons, sold with thousands of others into the Gold Coast's booming slave trade, and shipped off to America, where her children and grandchildren will be raised in slavery. One thread of Homegoing follows Effia's descendants through centuries of warfare in Ghana, as the Fante and Asante nations wrestle with the slave trade and British colonization. The other thread follows Esi and her children into America. From the plantations of the South to the Civil War and the Great Migration, from the coal mines of Pratt City, Alabama, to the jazz clubs and dope houses of twentieth-century Harlem, right up through the present day, Homegoing makes history visceral, and captures, with singular and stunning immediacy, how the memory of captivity came to be inscribed in the soul of a nation. <br /><br />Generation after generation, Yaa Gyasi's magisterial first novel sets the fate of the individual against the obliterating movements of time, delivering unforgettable characters whose lives were shaped by historical forces beyond their control. Homegoing is a tremendous reading experience, not to be missed, by an astonishingly gifted young writer."}},{"book":{"id":"1971304","imageUrl":"./images/1971304.jpg","title":"City of Thieves","numOfPages":"258","authors":"David Benioff","link":"https://www.goodreads.com/book/show/1971304.City_of_Thieves","publicationYear":"","averageRating":"4.28","ratingCount":"79733","description":"<b>From the critically acclaimed author of The 25th Hour, a captivating novel about war, courage, survival — and a remarkable friendship that ripples across a lifetime.</b><br /><br />During the Nazis’ brutal siege of Leningrad, Lev Beniov is arrested for looting and thrown into the same cell as a handsome deserter named Kolya. Instead of being executed, Lev and Kolya are given a shot at saving their own lives by complying with an outrageous directive: secure a dozen eggs for a powerful Soviet colonel to use in his daughter’s wedding cake. In a city cut off from all supplies and suffering unbelievable deprivation, Lev and Kolya embark on a hunt through the dire lawlessness of Leningrad and behind enemy lines to find the impossible.<br /><br />By turns insightful and funny, thrilling and terrifying, <i>City of Thieves</i> is a gripping, cinematic World War II adventure and an intimate coming-of-age story with an utterly contemporary feel for how boys become men."}},{"book":{"id":"9969571","imageUrl":"./images/9969571.jpg","title":"Ready Player One","numOfPages":"374","authors":"Ernest Cline","link":"https://www.goodreads.com/book/show/9969571-ready-player-one","publicationYear":"2011","averageRating":"4.31","ratingCount":"449067","description":"In the year 2044, reality is an ugly place. The only time teenage Wade Watts really feels alive is when he's jacked into the virtual utopia known as the  OASIS. Wade's devoted his life to studying the puzzles hidden within this world's digital confines, puzzles that are based on their creator's obsession with the pop culture of decades past and that promise massive power and fortune to whoever can unlock them. When Wade stumbles upon the first clue, he finds himself beset by players willing to kill to take this ultimate prize. The race is on, and if Wade's going to survive, he'll have to win—and confront the real world he's always been so desperate to escape."}},{"book":{"id":"16299","imageUrl":"./images/16299.jpg","title":"And Then There Were None","numOfPages":"264","authors":"Agatha Christie","link":"https://www.goodreads.com/book/show/16299.And_Then_There_Were_None","publicationYear":"","averageRating":"4.23","ratingCount":"474800","description":"First, there were ten - a curious assortment of strangers summoned as weekend guests to a private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal - and a secret that will seal their fate. For each has been marked for murder. One by one they fall prey. Before the weekend is out, there will be none. And only the dead are above suspicion."}},{"book":{"id":"22609522","imageUrl":"./images/22609522.jpg","title":"Red Notice: A True Story of High Finance, Murder, and One Man’s Fight for Justice","numOfPages":"380","authors":"Bill Browder","link":"https://www.goodreads.com/book/show/22609522-red-notice","publicationYear":"2015","averageRating":"4.36","ratingCount":"15035","description":"A real-life political thriller about an American financier in the Wild East of Russia, the murder of his principled young tax attorney, and his dangerous mission to expose the Kremlin's corruption.<br /><br />Bill Browder's journey started on the South Side of Chicago and moved through Stanford Business School to the dog-eat-dog world of hedge fund investing in the 1990s. It continued in Moscow, where Browder made his fortune heading the largest investment fund in Russia after the Soviet Union's collapse. But when he exposed the corrupt oligarchs who were robbing the companies in which he was investing, Vladimir Putin turned on him and, in 2005, had him expelled from Russia. <br /><br />In 2007, a group of law enforcement officers raided Browder's offices in Moscow and stole $230 million of taxes that his fund's companies had paid to the Russian government. Browder's attorney Sergei Magnitsky investigated the incident and uncovered a sprawling criminal enterprise. A month after Sergei testified against the officials involved, he was arrested and thrown into pre-trial detention, where he was tortured for a year. On November 16, 2009, he was led to an isolation chamber, handcuffed to a bedrail, and beaten to death by eight guards in full riot gear. <br /><br />Browder glimpsed the heart of darkness, and it transformed his life: he embarked on an unrelenting quest for justice in Sergei's name, exposing the towering cover-up that leads right up to Putin. A financial caper, a crime thriller, and a political crusade, <i>Red Notice</i> is the story of one man taking on overpowering odds to change the world."}},{"book":{"id":"25241317","imageUrl":"./images/25241317.jpg","title":"Black Flags: The Rise of ISIS","numOfPages":"368","authors":"Joby Warrick","link":"https://www.goodreads.com/book/show/25241317-black-flags","publicationYear":"2015","averageRating":"4.35","ratingCount":"6785","description":"<b>Pulitzer Prize-winning reporter Joby Warrick reveals how the strain of militant Islam now raising its banner across Iraq and Syria spread from a remote Jordanian prison with the unwitting aid of American military intervention.</b><br /><br />     When he succeeded his father in 1999, King Abdullah of Jordan released a batch of political prisoners in the hopes of smoothing his transition to power. Little did he know that among those released was Abu Musab al-Zarqawi, a man who would go on to become a terrorist mastermind too dangerous even for al-Qaeda and give rise to an Islamist movement bent on dominating the Middle East.<br />     Zarqawi began by directing hotel bombings and assassinations in Jordan from a base in northern Iraq, but it was the American invasion of that country in 2003 that catapulted him to the head of a vast insurgency. By identifying him as the link between Saddam and bin Laden, the CIA inadvertently created a monster. Like-minded radicals saw him as a hero resisting the infidel occupiers and rallied to his cause. Their wave of brutal beheadings and suicide bombings continued for years until Jordanian intelligence provided the Americans with the crucial intelligence needed to eliminate Zarqawi in a 2006 airstrike.<br />     But his movement endured, first called al-Qaeda in Iraq, then renamed Islamic State of Iraq and Syria, or ISIS, seeking refuge in unstable, ungoverned pockets on the Iraq-Syria border. And as the Syrian civil war broke out in 2011, ISIS seized its chance to pursue Zarqawi's dream of a sweeping, ultra-conservative Islamic caliphate. <br />     Drawing on unique access to CIA and Jordanian sources, Joby Warrick weaves together heart-pounding, moment-by-moment operational details with overarching historical perspectives to reveal the long trajectory of today's most dangerous Islamic extremist threat.<br /><br /><br /><i>From the Hardcover edition.</i>"}},{"book":{"id":"23153154","imageUrl":"./images/23153154.jpg","title":"Memory Man (Amos Decker, #1)","numOfPages":"416","authors":"David Baldacci","link":"https://www.goodreads.com/book/show/23153154-memory-man","publicationYear":"2015","averageRating":"4.05","ratingCount":"59015","description":"Amos Decker's life changed forever--twice.<br /><br />The first time was on the gridiron. A big, towering athlete, he was the only person from his hometown of Burlington ever to go pro. But his career ended before it had a chance to begin. On his very first play, a violent helmet-to-helmet collision knocked him off the field for good, and left him with an improbable side effect--he can never forget anything.<br /><br />The second time was at home nearly two decades later. Now a police detective, Decker returned from a stakeout one evening and entered a nightmare--his wife, young daughter, and brother-in-law had been murdered.<br /><br />His family destroyed, their killer's identity as mysterious as the motive behind the crime, and unable to forget a single detail from that horrible night, Decker finds his world collapsing around him. He leaves the police force, loses his home, and winds up on the street, taking piecemeal jobs as a private investigator when he can.<br /><br />But over a year later, a man turns himself in to the police and confesses to the murders. At the same time a horrific event nearly brings Burlington to its knees, and Decker is called back in to help with this investigation. Decker also seizes his chance to learn what really happened to his family that night. To uncover the stunning truth, he must use his remarkable gifts and confront the burdens that go along with them. He must endure the memories he would much rather forget. And he may have to make the ultimate sacrifice.<br /><br /><i>Memory Man</i> will stay with you long after the turn of the final page."}},{"book":{"id":"22543496","imageUrl":"./images/22543496.jpg","title":"Elon Musk: Inventing the Future","numOfPages":"392","authors":"Ashlee Vance","link":"https://www.goodreads.com/book/show/22543496-elon-musk","publicationYear":"2015","averageRating":"4.25","ratingCount":"83957","description":"In the spirit of Steve Jobs and Moneyball, Elon Musk is both an illuminating and authorized look at the extraordinary life of one of Silicon Valley’s most exciting, unpredictable, and ambitious entrepreneurs, Elon Musk—a real-life Tony Stark—and a fascinating exploration of the renewal of American invention and its new “makers”<br /><br />Elon Musk spotlights the technology and vision of Elon Musk, the renowned entrepreneur and innovator behind SpaceX, Tesla, and SolarCity, who sold one of his internet companies, PayPal, for $1.5 billion. Ashlee Vance captures the full spectacle and arc of the genius’s life and work, from his tumultuous upbringing in South Africa and flight to the United States to his dramatic technical innovations and entrepreneurial pursuits.<br /><br />Vance uses Musk’s story to explore one of the pressing questions of our age: can the nation of inventors and creators who led the modern world for a century still compete in an age of fierce global competition? He argues that Musk—one of the most unusual and striking figures in American business history—is a contemporary, visionary amalgam of legendary inventors and industrialists including Thomas Edison, Henry Ford, Howard Hughes, and Steve Jobs. More than any other entrepreneur today, Musk has dedicated his energies and his own vast fortune to inventing a future that is as rich and far-reaching as the visionaries of the golden age of science-fiction fantasy.<br /><br />Thorough and insightful, Elon Musk brings to life a technology industry that is rapidly and dramatically changing by examining the life of one of its most powerful and influential titans."}},{"book":{"id":"11297","imageUrl":"./images/11297.jpg","title":"Norwegian Wood","numOfPages":"296","authors":"Haruki Murakami","link":"https://www.goodreads.com/book/show/11297.Norwegian_Wood","publicationYear":"2000","averageRating":"4.02","ratingCount":"223705","description":"Toru, a quiet and preternaturally serious young college student in Tokyo, is devoted to Naoko, a beautiful and introspective young woman, but their mutual passion is marked by the tragic death of their best friend years before. Toru begins to adapt to campus life and the loneliness and isolation he faces there, but Naoko finds the pressures and responsibilities of life unbearable. As she retreats further into her own world, Toru finds himself reaching out to others and drawn to a fiercely independent and sexually liberated young woman.<br /><br />A poignant story of one college student's romantic coming-of-age, <b>Norwegian Wood</b> takes us to that distant place of a young man's first, hopeless, and heroic love."}},{"book":{"id":"5107","imageUrl":"./images/5107.jpg","title":"The Catcher in the Rye","numOfPages":"277","authors":"J.D. Salinger","link":"https://www.goodreads.com/book/show/5107.The_Catcher_in_the_Rye","publicationYear":"2001","averageRating":"3.79","ratingCount":"2153963","description":"The hero-narrator of <i>The Catcher in the Rye</i> is an ancient child of sixteen, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days. The boy himself is at once too simple and too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it. There are many voices in this novel: children's voices, adult voices, underground voices-but Holden's voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain and pleasure. However, like most lovers and clowns and poets of the higher orders, he keeps most of the pain to, and for, himself. The pleasure he gives away, or sets aside, with all his heart. It is there for the reader who can handle it to keep. <br /><br />J.D. Salinger's classic novel of teenage angst and rebellion was first published in 1951. The novel was included on <i>Time</i>'s 2005 list of the 100 best English-language novels written since 1923. It was named by Modern Library and its readers as one of the 100 best English-language novels of the 20th century. It has been frequently challenged in the court for its liberal use of profanity and portrayal of sexuality and in the 1950's and 60's it was the novel that every teenage boy wants to read."}},{"book":{"id":"16115612","imageUrl":"./images/16115612.jpg","title":"And the Mountains Echoed","numOfPages":"404","authors":"Khaled Hosseini","link":"https://www.goodreads.com/book/show/16115612-and-the-mountains-echoed","publicationYear":"2013","averageRating":"4.03","ratingCount":"233285","description":"<b>An unforgettable novel about finding a lost piece of yourself in someone else.</b><br /><br />Khaled Hosseini, the #1 <i>New York Times</i>–bestselling author of <i>The Kite Runner</i> and <i>A Thousand Splendid Suns</i>, has written a new novel about how we love, how we take care of one another, and how the choices we make resonate through generations. <br /><br />In this tale revolving around not just parents and children but brothers and sisters, cousins and caretakers, Hosseini explores the many ways in which families nurture, wound, betray, honor, and sacrifice for one another; and how often we are surprised by the actions of those closest to us, at the times that matter most. <br /><br />Following its characters and the ramifications of their lives and choices and loves around the globe—from Kabul to Paris to San Francisco to the Greek island of Tinos—the story expands gradually outward, becoming more emotionally complex and powerful with each turning page."}},{"book":{"id":"18656030","imageUrl":"./images/18656030.jpg","title":"Cibola Burn (The Expanse, #4)","numOfPages":"581","authors":"James S.A. Corey","link":"https://www.goodreads.com/book/show/18656030-cibola-burn","publicationYear":"2014","averageRating":"4.12","ratingCount":"30703","description":"<b>The fourth novel in James S.A. Corey’s New York Times bestselling Expanse series</b><br /><br />The gates have opened the way to thousands of habitable planets, and the land rush has begun. Settlers stream out from humanity's home planets in a vast, poorly controlled flood, landing on a new world. Among them, the Rocinante, haunted by the vast, posthuman network of the protomolecule as they investigate what destroyed the great intergalactic society that built the gates and the protomolecule.<br /><br />But Holden and his crew must also contend with the growing tensions between the settlers and the company which owns the official claim to the planet. Both sides will stop at nothing to defend what's theirs, but soon a terrible disease strikes and only Holden - with help from the ghostly Detective Miller - can find the cure."}},{"book":{"id":"18143977","imageUrl":"./images/18143977.jpg","title":"All the Light We Cannot See","numOfPages":"531","authors":"Anthony Doerr","link":"https://www.goodreads.com/book/show/18143977-all-the-light-we-cannot-see","publicationYear":"2014","averageRating":"4.31","ratingCount":"573165","description":"A stunningly ambitious and beautiful novel about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II. <br /><br />From the highly acclaimed, multiple award-winning Anthony Doerr, a stunningly ambitious and beautiful novel about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II. <br /><br />Marie Laure lives with her father in Paris within walking distance of the Museum of Natural History where he works as the master of the locks (there are thousands of locks in the museum). When she is six, she goes blind, and her father builds her a model of their neighborhood, every house, every manhole, so she can memorize it with her fingers and navigate the real streets with her feet and cane. When the Germans occupy Paris, father and daughter flee to Saint-Malo on the Brittany coast, where Marie-Laure's agoraphobic great uncle lives in a tall, narrow house by the sea wall. <br /><br />In another world in Germany, an orphan boy, Werner, grows up with his younger sister, Jutta, both enchanted by a crude radio Werner finds. He becomes a master at building and fixing radios, a talent that wins him a place at an elite and brutal military academy and, ultimately, makes him a highly specialized tracker of the Resistance. Werner travels through the heart of Hitler Youth to the far-flung outskirts of Russia, and finally into Saint-Malo, where his path converges with Marie-Laure.<br /><br />Doerr's gorgeous combination of soaring imagination with observation is electric. Deftly interweaving the lives of Marie-Laure and Werner, Doerr illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, All the Light We Cannot See is his most ambitious and dazzling work."}},{"book":{"id":"24356703","imageUrl":"./images/24356703.jpg","title":"Memory Man (Amos Decker, #1)","numOfPages":"417","authors":"David Baldacci","link":"https://www.goodreads.com/book/show/24356703-memory-man","publicationYear":"","averageRating":"4.05","ratingCount":"59015","description":"Amos Decker's life changed forever--twice.<br /><br />The first time was on the gridiron. A big, towering athlete, he was the only person from his hometown of Burlington ever to go pro. But his career ended before it had a chance to begin. On his very first play, a violent helmet-to-helmet collision knocked him off the field for good, and left him with an improbable side effect--he can never forget anything.<br /><br />The second time was at home nearly two decades later. Now a police detective, Decker returned from a stakeout one evening and entered a nightmare--his wife, young daughter, and brother-in-law had been murdered.<br /><br />His family destroyed, their killer's identity as mysterious as the motive behind the crime, and unable to forget a single detail from that horrible night, Decker finds his world collapsing around him. He leaves the police force, loses his home, and winds up on the street, taking piecemeal jobs as a private investigator when he can.<br /><br />But over a year later, a man turns himself in to the police and confesses to the murders. At the same time a horrific event nearly brings Burlington to its knees, and Decker is called back in to help with this investigation. Decker also seizes his chance to learn what really happened to his family that night. To uncover the stunning truth, he must use his remarkable gifts and confront the burdens that go along with them. He must endure the memories he would much rather forget. And he may have to make the ultimate sacrifice.<br /><br /><i>Memory Man</i> will stay with you long after the turn of the final page."}},{"book":{"id":"18007564","imageUrl":"./images/18007564.jpg","title":"The Martian","numOfPages":"369","authors":"Andy Weir","link":"https://www.goodreads.com/book/show/18007564-the-martian","publicationYear":"2014","averageRating":"4.39","ratingCount":"541249","description":"Six days ago, astronaut Mark Watney became one of the first people to walk on Mars. <br /><br />Now, he’s sure he’ll be the first person to die there.<br /><br />After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he’s alive — and even if he could get word out, his supplies would be gone long before a rescue could arrive. <br /><br />Chances are, though, he won’t have time to starve to death. The damaged machinery, unforgiving environment, or plain-old “human error” are much more likely to kill him first. <br /><br />But Mark isn’t ready to give up yet. Drawing on his ingenuity, his engineering skills — and a relentless, dogged refusal to quit — he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him?<br /><br />"}},{"book":{"id":"15818107","imageUrl":"./images/15818107.jpg","title":"Orphan Train","numOfPages":"278","authors":"Christina Baker Kline","link":"https://www.goodreads.com/book/show/15818107-orphan-train","publicationYear":"2013","averageRating":"4.14","ratingCount":"271299","description":"The author of <i>Bird in Hand</i> and <i>The Way Life Should Be</i> delivers her most ambitious and powerful novel to date: a captivating story of two very different women who build an unexpected friendship: a 91-year-old woman with a hidden past as an orphan-train rider and the teenage girl whose own troubled adolescence leads her to seek answers to questions no one has ever thought to ask.<br /><br />Nearly eighteen, Molly Ayer knows she has one last chance. Just months from \"aging out\" of the child welfare system, and close to being kicked out of her foster home, a community service position helping an elderly woman clean out her home is the only thing keeping her out of juvie and worse.<br /><br />Vivian Daly has lived a quiet life on the coast of Maine. But in her attic, hidden in trunks, are vestiges of a turbulent past. As she helps Vivian sort through her possessions and memories, Molly discovers that she and Vivian aren't as different as they seem to be. A young Irish immigrant orphaned in New York City, Vivian was put on a train to the Midwest with hundreds of other children whose destinies would be determined by luck and chance.<br /><br />The closer Molly grows to Vivian, the more she discovers parallels to her own life. A Penobscot Indian, she, too, is an outsider being raised by strangers, and she, too, has unanswered questions about the past. As her emotional barriers begin to crumble, Molly discovers that she has the power to help Vivian find answers to mysteries that have haunted her for her entire life - answers that will ultimately free them both.<br /><br />Rich in detail and epic in scope, <i>Orphan Train</i> is a powerful novel of upheaval and resilience, of second chances, of unexpected friendship, and of the secrets we carry that keep us from finding out who we are."}},{"book":{"id":"6442950","imageUrl":"./images/6442950.jpg","title":"Fool's Gold","numOfPages":"338","authors":"Gillian Tett","link":"https://www.goodreads.com/book/show/6442950-fool-s-gold","publicationYear":"2009","averageRating":"3.82","ratingCount":"2446","description":"From award-winning \"Financial Times\" journalist Gillian Tett, who enraged Wall Street leaders with her newsbreaking warnings of a crisis more than a year ahead of the curve, \"Fool's Gold\" tells the astonishing unknown story at the heart of the 2008 meltdown. Drawing on exclusive access to J.P. Morgan CEO Jamie Dimon and a tightly bonded team of bankers known on Wall Street as the \"Morgan Mafia,\" as well as in-depth interviews with dozens of other key players, including Treasury Secretary Timothy Geithner, Tett brings to life in gripping detail how the Morgan team's bold ideas for a whole new kind of financial alchemy helped to ignite a revolution in banking, and how that revolution escalated wildly out of control.<br /><br />The deeply reported and lively narrative takes readers behind the scenes, to the inner sanctums of elite finance and to the secretive reaches of what came to be known as the \"shadow banking\" world. The story begins with the intense Morgan brainstorming session in 1994 beside a pool in Boca Raton, where the team cooked up a dazzling new idea for the exotic financial product known as credit derivatives. That idea would rip around the banking world, catapult Morgan to the top of the turbocharged derivatives trade, and fuel an extraordinary banking boom that seemed to have unleashed banks from ages-old constraints of risk.<br /><br />But when the Morgan team's derivatives dream collided with the housing boom, and was perverted -- through hubris, delusion, and sheer greed -- by titans of banking that included Citigroup, UBS, Deutsche Bank, and the thundering herd at Merrill Lynch -- even as J.P. Morgan itself stayed well away from the risky concoctions others were peddling -- catastrophe followed. Tett's access to Dimon and the J.P. Morgan leaders who so skillfully steered their bank away from the wild excesses of others sheds invaluable light not only on the untold story of how they engineered their bank's escape from carnage but also on how possible it was for the larger banking world, regulators, and rating agencies to have spotted, and heeded, the terrible risks of a meltdown.<br /><br />A tale of blistering brilliance and willfully blind ambition, \"Fool's Gold\" is both a rare journey deep inside the arcane and wildly competitive world of high finance and a vital contribution to understanding how the worst economic crisis since the Great Depression was perpetrated."}},{"book":{"id":"11870085","imageUrl":"./images/11870085.jpg","title":"The Fault in Our Stars","numOfPages":"313","authors":"John Green","link":"https://www.goodreads.com/book/show/11870085-the-fault-in-our-stars","publicationYear":"2012","averageRating":"4.26","ratingCount":"2544275","description":"<i>There is an alternate cover edition <a href=\"https://www.goodreads.com/book/show/25856606-the-fault-in-our-stars\" rel=\"nofollow\">here</a>.</i><br /><br />\"I fell in love the way you fall asleep: slowly, then all at once.\"<br /><br />Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.<br /><br />Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love."}},{"book":{"id":"17262159","imageUrl":"./images/17262159.jpg","title":"Never Go Back (Jack Reacher, #18)","numOfPages":"400","authors":"Lee Child","link":"https://www.goodreads.com/book/show/17262159-never-go-back","publicationYear":"2013","averageRating":"4.02","ratingCount":"43854","description":"After an epic and interrupted journey all the way from the snows of South Dakota, Jack Reacher has finally made it to Virginia. His destination: a sturdy stone building a short bus ride from Washington D.C., the headquarters of his old unit, the 110th MP. It was the closest thing to a home he ever had.<p>Why? He wants to meet the new commanding officer, Major Susan Turner. He liked her voice on the phone. But the officer sitting behind Reacher’s old desk isn't a woman. Why is Susan Turner not there?</p><p>What Reacher doesn’t expect is what comes next. He himself is in big trouble, accused of a sixteen-year-old homicide. And he certainly doesn't expect to hear these words: ‘You’re back in the army, Major. And your ass is mine.’</p><p>Will he be sorry he went back? Or – will someone else?</p>"}},{"book":{"id":"128029","imageUrl":"./images/128029.jpg","title":"A Thousand Splendid Suns","numOfPages":"372","authors":"Khaled Hosseini","link":"https://www.goodreads.com/book/show/128029.A_Thousand_Splendid_Suns","publicationYear":"","averageRating":"4.34","ratingCount":"880214","description":"At once an incredible chronicle of thirty years of Afghan history and a deeply moving story of family, friendship, faith, and the salvation to be found in love.<br /><br />Propelled by the same superb instinct for storytelling that made The Kite Runner a beloved classic, A Thousand Splendid Suns is at once an incredible chronicle of thirty years of Afghan history and a deeply moving story of family, friendship, faith, and the salvation to be found in love. <br /><br />Born a generation apart and with very different ideas about love and family, Mariam and Laila are two women brought jarringly together by war, by loss and by fate. As they endure the ever escalating dangers around them - in their home as well as in the streets of Kabul - they come to form a bond that makes them both sisters and mother-daughter to each other, and that will ultimately alter the course not just of their own lives but of the next generation. With heart-wrenching power and suspense, Hosseini shows how a woman's love for her family can move her to shocking and heroic acts of self-sacrifice, and that in the end it is love, or even the memory of love, that is often the key to survival."}},{"book":{"id":"10872085","imageUrl":"./images/10872085.jpg","title":"Only Time Will Tell (The Clifton Chronicles, #1)","numOfPages":"","authors":"Jeffrey Archer","link":"https://www.goodreads.com/book/show/10872085-only-time-will-tell","publicationYear":"","averageRating":"4.04","ratingCount":"55709","description":"<b>\n  <blockquote>From the internationally bestselling author of <i>Kane and Abel</i> and <i>A Prisoner of Birth</i> comes <i>Only Time Will Tell</i>, the first in an ambitious new series that tells the story of one family across generations, across oceans, from heartbreak to triumph.</blockquote>\n</b>The epic tale of Harry Clifton’s life begins in 1920, with the words “I was told that my father was killed in the war.” A dock worker in Bristol, Harry never knew his father, but he learns about life on the docks from his uncle, who expects Harry to join him at the shipyard once he’s left school. But then an unexpected gift wins him a scholarship to an exclusive boys’ school, and his life will never be the same again.<p>As he enters into adulthood, Harry finally learns how his father really died, but the awful truth only leads him to question, was he even his father? Is he the son of Arthur Clifton, a stevedore who spent his whole life on the docks, or the firstborn son of a scion of West Country society, whose family owns a shipping line?</p><p>This introductory novel in Archer’s ambitious series The Clifton Chronicles includes a cast of colorful characters and takes us from the ravages of the Great War to the outbreak of the Second World War, when Harry must decide whether to take up a place at Oxford or join the navy and go to war with Hitler’s Germany. From the docks of working-class England to the bustling streets of 1940 New York City, <i>Only Time Will Tell</i> takes readers on a journey through to future volumes, which will bring to life one hundred years of recent history to reveal a family story that neither the reader nor Harry Clifton himself could ever have imagined.</p>"}},{"book":{"id":"13281368","imageUrl":"./images/13281368.jpg","title":"The Twelve (The Passage, #2)","numOfPages":"568","authors":"Justin Cronin","link":"https://www.goodreads.com/book/show/13281368-the-twelve","publicationYear":"2012","averageRating":"3.99","ratingCount":"69017","description":"In his internationally bestselling and critically acclaimed novel <i>The Passage</i>, Justin Cronin constructed an unforgettable world transformed by a government experiment gone horribly wrong. Now the scope widens and the intensity deepens as the epic story surges forward with <i>The Twelve</i>.<br /><br />In the present day, as the man-made apocalypse unfolds, three strangers navigate the chaos. Lila, a doctor and an expectant mother, is so shattered by the spread of violence and infection that she continues to plan for her child’s arrival even as society dissolves around her. Kittridge, known to the world as “Last Stand in Denver,” has been forced to flee his stronghold and is now on the road, dodging the infected, armed but alone and well aware that a tank of gas will get him only so far. April is a teenager fighting to guide her little brother safely through a landscape of death and ruin. These three will learn that they have not been fully abandoned—and that in connection lies hope, even on the darkest of nights.<br /><br />One hundred years in the future, Amy and the others fight on for humankind’s salvation...unaware that the rules have changed. The enemy has evolved, and a dark new order has arisen with a vision of the future infinitely more horrifying than man’s extinction. If the Twelve are to fall, one of those united to vanquish them will have to pay the ultimate price."}},{"book":{"id":"13148921","imageUrl":"./images/13148921.jpg","title":"Bloodline (Sigma Force, #8)","numOfPages":"464","authors":"James Rollins","link":"https://www.goodreads.com/book/show/13148921-bloodline","publicationYear":"2012","averageRating":"4.23","ratingCount":"15490","description":"<b>\n  <blockquote><i>New York Times</i> bestselling author James Rollins takes you to the edge of modern medicine, genetics, and technology, revealing the next evolutionary leap forward: Immortality — a future conceived through the monstrous ingenuity of man...</blockquote>\n</b>Galilee, 1025. A cunning Templar knight uncovers a holy treasure: the Bachal Isu — the staff of Jesus Christ — a priceless icon that holds a mysterious and terrifying power that will forever change humanity if unleashed.<p>A millennium later, Somali pirates hijack a yacht off the coast off the Horn of Africa, kidnapping a young pregnant American woman and brutally killing her husband. Painter Crowe and his SIGMA team are enlisted for the top secret rescue mission. The kidnapped woman is Amanda Gant-Bennett, the daughter of U.S. president James Gant. Crowe is more than a little suspicious that the kidnapping masks a far more nefarious plot.</p><p>In the field, Commander Gray Pierce leads his small team of operatives into the treacherous African jungle to find the missing woman. But what should be a straightforward rescue turns into a fiery ambush and a deadly act of betrayal. As Commander Pierce and his team discover, the hostage is a pawn in a shattering act of terrorism with dark and shocking repercussions. And the danger is only beginning...</p>"}},{"book":{"id":"9975779","imageUrl":"./images/9975779.jpg","title":"Portrait of a Spy (Gabriel Allon, #11)","numOfPages":"448","authors":"Daniel Silva","link":"https://www.goodreads.com/book/show/9975779-portrait-of-a-spy","publicationYear":"2011","averageRating":"4.24","ratingCount":"19910","description":"A man with a deep appreciation for all that is beautiful, Gabriel is also an angel of vengeance, an international operative who will stop at nothing to see justice done. Sometimes he must journey far in search of evil. And sometimes evil comes to him.<p>\n  <b>\"In a dangerous world, one extraordinary woman can mean the difference between life and death. . . .\"</b>\n</p><p> For Gabriel and his wife, Chiara, it was supposed to be the start of a pleasant weekend in London--a visit to a gallery in St. James's to authenticate a newly discovered painting by Titian, followed by a quiet lunch. But a pair of deadly bombings in Paris and Copenhagen has already marred this autumn day. And while walking toward Covent Garden, Gabriel notices a man he believes is about to carry out a third attack. Before Gabriel can draw his weapon, he is knocked to the pavement and can only watch as the nightmare unfolds.</p><p>Haunted by his failure to stop the massacre of innocents, Gabriel returns to his isolated cottage on the cliffs of Cornwall, until a summons brings him to Washington and he is drawn into a confrontation with the new face of global terror. At the center of the threat is an American-born cleric in Yemen to whom Allah has granted \"a beautiful and seductive tongue.\" A gifted deceiver, who was once a paid CIA asset, the mastermind is plotting a new wave of attacks.</p><p>Gabriel and his team devise a daring plan to destroy the network of death from the inside, a gambit fraught with risk, both personal and professional. To succeed, Gabriel must reach into his violent past. A woman waits there--a reclusive heiress and art collector who can traverse the murky divide between Islam and the West. She is the daughter of an old enemy, a woman joined to Gabriel by a trail of blood. . . .</p>"}},{"book":{"id":"9736930","imageUrl":"./images/9736930.jpg","title":"Before I Go to Sleep","numOfPages":"359","authors":"S.J. Watson","link":"https://www.goodreads.com/book/show/9736930-before-i-go-to-sleep","publicationYear":"2011","averageRating":"3.87","ratingCount":"217247","description":"Memories define us. So what if you lost yours every time you went to sleep? Welcome to Christine's life.<br /><br />S. J. Watson makes his debut with this fast-paced psychological thriller, reminiscent of Shutter Island and Memento.<br /><br />A terrible accident has robbed Christine of her memories. She cannot remember the past - or even yesterday. Determined to discover who she is, she has begun keeping a journal before she goes to sleep. Before she can forget again.<br /><br />But the truth may be more terrifying - and deadlier - than she bargained for..."}},{"book":{"id":"9938498","imageUrl":"./images/9938498.jpg","title":"In the Garden of Beasts: Love, Terror, and an American Family in Hitler's Berlin","numOfPages":"448","authors":"Erik Larson","link":"https://www.goodreads.com/book/show/9938498-in-the-garden-of-beasts","publicationYear":"2011","averageRating":"3.81","ratingCount":"124853","description":"The time is 1933, the place, Berlin, when William E. Dodd becomes America's first ambassador to Hitler's Germany in a year that proved to be a turning point in history.<p>A mild-mannered professor from Chicago, Dodd brings along his wife, son, and flamboyant daughter, Martha. At first Martha is entranced by the parties and pomp, and the handsome young men of the Third Reich with their infectious enthusiasm for restoring Germany to a position of world prominence. Enamored of the New Germany, she has one affair after another, including with the surprisingly honorable first chief of the Gestapo, Rudolf Diels. But as evidence of Jewish persecution mounts, confirmed by chilling first-person testimony, her father telegraphs his concerns to a largely indifferent State Department back home. Dodd watches with alarm as Jews are attacked, the press is censored, and drafts of frightening new laws begin to circulate. As that first year unfolds and the shadows deepen, the Dodds experience days full of excitement, intrigue, romance and ultimately, horror, when a climactic spasm of violence and murder reveals Hitler's true character and ruthless ambition.</p><p>Suffused with the tense atmosphere of the period, and with unforgettable portraits of the bizarre Goring and the expectedly charming—yet wholly sinister—Goebbels, <em>In the Garden of Beasts</em> lends a stunning, eyewitness perspective on events as they unfold in real time, revealing an era of surprising nuance and complexity. The result is a dazzling, addictively readable work that speaks volumes about why the world did not recognize the grave threat posed by Hitler until Berlin, and Europe, were awash in blood and terror.</p>"}},{"book":{"id":"19501","imageUrl":"./images/19501.jpg","title":"Eat, Pray, Love","numOfPages":"334","authors":"Elizabeth Gilbert","link":"https://www.goodreads.com/book/show/19501.Eat_Pray_Love","publicationYear":"","averageRating":"3.51","ratingCount":"1221342","description":"A celebrated writer's irresistible, candid, and eloquent account of her pursuit of worldly pleasure, spiritual devotion, and what she really wanted out of life. <br /><br />Around the time Elizabeth Gilbert turned thirty, she went through an early-onslaught midlife crisis. She had everything an educated, ambitious American woman was supposed to want—a husband, a house, a successful career. But instead of feeling happy and fulfilled, she was consumed with panic, grief, and confusion. She went through a divorce, a crushing depression, another failed love, and the eradication of everything she ever thought she was supposed to be. <br /><br />To recover from all this, Gilbert took a radical step. In order to give herself the time and space to find out who she really was and what she really wanted, she got rid of her belongings, quit her job, and undertook a yearlong journey around the world—all alone. Eat, Pray, Love is the absorbing chronicle of that year. Her aim was to visit three places where she could examine one aspect of her own nature set against the backdrop of a culture that has traditionally done that one thing very well. In Rome, she studied the art of pleasure, learning to speak Italian and gaining the twenty-three happiest pounds of her life. India was for the art of devotion, and with the help of a native guru and a surprisingly wise cowboy from Texas, she embarked on four uninterrupted months of spiritual exploration. In Bali, she studied the art of balance between worldly enjoyment and divine transcendence. She became the pupil of an elderly medicine man and also fell in love the best way—unexpectedly. <br /><br />An intensely articulate and moving memoir of self-discovery, Eat, Pray, Love is about what can happen when you claim responsibility for your own contentment and stop trying to live in imitation of society’s ideals. It is certain to touch anyone who has ever woken up to the unrelenting need for change."}},{"book":{"id":"6493208","imageUrl":"./images/6493208.jpg","title":"The Immortal Life of Henrietta Lacks","numOfPages":"370","authors":"Rebecca Skloot","link":"https://www.goodreads.com/book/show/6493208-the-immortal-life-of-henrietta-lacks","publicationYear":"2010","averageRating":"4.04","ratingCount":"415002","description":"<blockquote>\n  <b>Intimate in feeling, astonishing in scope, and impossible to put down, The Immortal Life of Henrietta Lacks captures the beauty and drama of scientific discovery, as well as its human consequences.</b>\n</blockquote>Her name was Henrietta Lacks, but scientists know her as HeLa. She was a poor Southern tobacco farmer who worked the same land as her slave ancestors, yet her cells—taken without her knowledge—became one of the most important tools in medicine. The first “immortal” human cells grown in culture, they are still alive today, though she has been dead for more than sixty years. If you could pile all HeLa cells ever grown onto a scale, they’d weigh more than 50 million metric tons—as much as a hundred Empire State Buildings. HeLa cells were vital for developing the polio vaccine; uncovered secrets of cancer, viruses, and the atom bomb’s effects; helped lead to important advances like in vitro fertilization, cloning, and gene mapping; and have been bought and sold by the billions.<p>Yet Henrietta Lacks remains virtually unknown, buried in an unmarked grave.</p><p>Now Rebecca Skloot takes us on an extraordinary journey, from the “colored” ward of Johns Hopkins Hospital in the 1950s to stark white laboratories with freezers full of HeLa cells; from Henrietta’s small, dying hometown of Clover, Virginia — a land of wooden slave quarters, faith healings, and voodoo — to East Baltimore today, where her children and grandchildren live and struggle with the legacy of her cells.</p><p>Henrietta’s family did not learn of her “immortality” until more than twenty years after her death, when scientists investigating HeLa began using her husband and children in research without informed consent. And though the cells had launched a multimillion-dollar industry that sells human biological materials, her family never saw any of the profits. As Rebecca Skloot so brilliantly shows, the story of the Lacks family — past and present — is inextricably connected to the dark history of experimentation on African Americans, the birth of bioethics, and the legal battles over whether we control the stuff we are made of.</p><p>Over the decade it took to uncover this story, Rebecca became enmeshed in the lives of the Lacks family—especially Henrietta’s daughter Deborah, who was devastated to learn about her mother’s cells. She was consumed with questions: Had scientists cloned her mother? Did it hurt her when researchers infected her cells with viruses and shot them into space? What happened to her sister, Elsie, who died in a mental institution at the age of fifteen? And if her mother was so important to medicine, why couldn’t her children afford health insurance?</p><p>Intimate in feeling, astonishing in scope, and impossible to put down, <i>The Immortal Life of Henrietta Lacks</i> captures the beauty and drama of scientific discovery, as well as its human consequences.</p>"}},{"book":{"id":"2429135","imageUrl":"./images/2429135.jpg","title":"The Girl with the Dragon Tattoo (Millennium, #1)","numOfPages":"465","authors":"Stieg Larsson","link":"https://www.goodreads.com/book/show/2429135.The_Girl_with_the_Dragon_Tattoo","publicationYear":"2008","averageRating":"4.11","ratingCount":"1970147","description":"A spellbinding amalgam of murder mystery, family saga, love story and financial intrigue.<br /><br />A Sensational #1 Bestseller – Now a Major Motion Picture In Theaters March 2010.<br /><br />A spellbinding amalgam of murder mystery, family saga, love story, and financial intrigue.<br /><br />It’s about the disappearance forty years ago of Harriet Vanger, a young scion of one of the wealthiest families in Sweden . . . and about her octogenarian uncle, determined to know the truth about what he believes was her murder.<br /><br />It’s about Mikael Blomkvist, a crusading journalist recently at the wrong end of a libel case, hired to get to the bottom of Harriet’s disappearance . . . and about Lisbeth Salander, a twenty-four-year-old pierced and tattooed genius hacker possessed of the hard-earned wisdom of someone twice her age—and a terrifying capacity for ruthlessness to go with it—who assists Blomkvist with the investigation. This unlikely team discovers a vein of nearly unfathomable iniquity running through the Vanger family, astonishing corruption in the highest echelons of Swedish industrialism—and an unexpected connection between themselves.<br /><br />It’s a contagiously exciting, stunningly intelligent novel about society at its most hidden, and about the intimate lives of a brilliantly realized cast of characters, all of them forced to face the darker aspects of their world and of their own lives."}},{"book":{"id":"960","imageUrl":"./images/960.jpg","title":"Angels & Demons  (Robert Langdon, #1)","numOfPages":"736","authors":"Dan Brown","link":"https://www.goodreads.com/book/show/960.Angels_Demons","publicationYear":"2006","averageRating":"3.86","ratingCount":"2112380","description":"An ancient secret brotherhood.<br />A devastating new weapon of destruction.<br />An unthinkable target... <br /><br />When world-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a mysterious symbol -- seared into the chest of a murdered physicist -- he discovers evidence of the unimaginable: the resurgence of an ancient secret brotherhood known as the Illuminati... the most powerful underground organization ever to walk the earth. The Illuminati has surfaced from the shadows to carry out the final phase of its legendary vendetta against its most hated enemy... the Catholic Church. <br /><br />Langdon's worst fears are confirmed on the eve of the Vatican's holy conclave, when a messenger of the Illuminati announces he has hidden an unstoppable time bomb at the very heart of Vatican City. With the countdown under way, Langdon jets to Rome to join forces with Vittoria Vetra, a beautiful and mysterious Italian scientist, to assist the Vatican in a desperate bid for survival. <br /><br />Embarking on a frantic hunt through sealed crypts, dangerous catacombs, deserted cathedrals, and even to the heart of the most secretive vault on earth, Langdon and Vetra follow a 400-year old trail of ancient symbols that snakes across Rome toward the long-forgotten Illuminati lair... a secret location that contains the only hope for Vatican salvation. <br /><br />An explosive international thriller, Angels &amp; Demons careens from enlightening epiphanies to dark truths as the battle between science and religion turns to war."}},{"book":{"id":"2767052","imageUrl":"./images/2767052.jpg","title":"The Hunger Games (The Hunger Games, #1)","numOfPages":"374","authors":"Suzanne Collins","link":"https://www.goodreads.com/book/show/2767052-the-hunger-games","publicationYear":"2008","averageRating":"4.34","ratingCount":"5036315","description":"<b>Winning will make you famous. <br />Losing means certain death.</b><br /><br />The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.<br /><br />When 16-year-old Katniss's young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives. , she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature."}},{"book":{"id":"13496","imageUrl":"./images/13496.jpg","title":"A Game of Thrones (A Song of Ice and Fire, #1)","numOfPages":"848","authors":"George R.R. Martin","link":"https://www.goodreads.com/book/show/13496.A_Game_of_Thrones","publicationYear":"2005","averageRating":"4.45","ratingCount":"1477484","description":"Summers span decades. Winter can last a lifetime. And the struggle for the Iron Throne has begun.<br /><br />As Warden of the north, Lord Eddard Stark counts it a curse when King Robert bestows on him the office of the Hand. His honour weighs him down at court where a true man does what he will, not what he must … and a dead enemy is a thing of beauty.<br /><br />The old gods have no power in the south, Stark’s family is split and there is treachery at court. Worse, the vengeance-mad heir of the deposed Dragon King has grown to maturity in exile in the Free Cities. He claims the Iron Throne."}},{"book":{"id":"9361589","imageUrl":"./images/9361589.jpg","title":"The Night Circus","numOfPages":"400","authors":"Erin Morgenstern","link":"https://www.goodreads.com/book/show/9361589-the-night-circus","publicationYear":"2011","averageRating":"4.03","ratingCount":"485198","description":"The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night...<br /><br />The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night. <br /><br />But behind the scenes, a fierce competition is underway - a duel between two young magicians, Celia and Marco, who have been trained since childhood expressly for this purpose by their mercurial instructors. Unbeknownst to them, this is a game in which only one can be left standing, and the circus is but the stage for a remarkable battle of imagination and will. Despite themselves, however, Celia and Marco tumble headfirst into love - a deep, magical love that makes the lights flicker and the room grow warm whenever they so much as brush hands. <br /><br />True love or not, the game must play out, and the fates of everyone involved, from the cast of extraordinary circus per­formers to the patrons, hang in the balance, suspended as precariously as the daring acrobats overhead. <br /><br />Written in rich, seductive prose, this spell-casting novel is a feast for the senses and the heart."}},{"book":{"id":"3","imageUrl":"./images/3.jpg","title":"Harry Potter and the Sorcerer's Stone","numOfPages":"320","authors":"J.K. Rowling","link":"https://www.goodreads.com/book/show/3.Harry_Potter_and_the_Sorcerer_s_Stone","publicationYear":"1997","averageRating":"4.45","ratingCount":"4931988","description":"Harry Potter's life is miserable. His parents are dead and he's stuck with his heartless relatives, who force him to live in a tiny closet under the stairs. But his fortune changes when he receives a letter that tells him the truth about himself: he's a wizard. A mysterious visitor rescues him from his relatives and takes him to his new home, Hogwarts School of Witchcraft and Wizardry.<br /><br />After a lifetime of bottling up his magical powers, Harry finally feels like a normal kid. But even within the Wizarding community, he is special. He is the boy who lived: the only person to have ever survived a killing curse inflicted by the evil Lord Voldemort, who launched a brutal takeover of the Wizarding world, only to vanish after failing to kill Harry.<br /><br />Though Harry's first year at Hogwarts is the best of his life, not everything is perfect. There is a dangerous secret object hidden within the castle walls, and Harry believes it's his responsibility to prevent it from falling into evil hands. But doing so will bring him into contact with forces more terrifying than he ever could have imagined.<br /><br />Full of sympathetic characters, wildly imaginative situations, and countless exciting details, the first installment in the series assembles an unforgettable magical world and sets the stage for many high-stakes adventures to come."}}],"currentReading":[{"book":{"id":"30809689","title":"Norse Mythology","numOfPages":"297","authors":"Neil Gaiman","link":"https://www.goodreads.com/book/show/30809689-norse-mythology","imageUrl":"./images/30809689.jpg","publicationYear":"","averageRating":"4.11","ratingCount":"46849","description":"<strong>Introducing an instant classic—master storyteller Neil Gaiman presents a dazzling version of the great Norse myths.</strong><br /><br />Neil Gaiman has long been inspired by ancient mythology in creating the fantastical realms of his fiction. Now he turns his attention back to the source, presenting a bravura rendition of the great northern tales. In <em>Norse Mythology</em>, Gaiman fashions primeval stories into a novelistic arc that begins with the genesis of the legendary nine worlds; delves into the exploits of the deities, dwarves, and giants; and culminates in Ragnarok, the twilight of the gods and the rebirth of a new time and people. Gaiman stays true to the myths while vividly reincarnating Odin, the highest of the high, wise, daring, and cunning; Thor, Odin’s son, incredibly strong yet not the wisest of gods; and Loki, the son of a giant, a trickster and unsurpassable manipulator. From Gaiman’s deft and witty prose emerges the gods with their fiercely competitive natures, their susceptibility to being duped and to dupe others, and their tendency to let passion ignite their actions, making these long-ago myths breathe pungent life again."}},{"book":{"id":"30654616","title":"Paternus (Paternus, #1)","numOfPages":"464","authors":"Dyrk Ashton","link":"https://www.goodreads.com/book/show/30654616-paternus","imageUrl":"./images/30654616.jpg","publicationYear":"2016","averageRating":"4.22","ratingCount":"312","description":"<b>Even myths have legends. And not all legends are myth.</b><br /><br />The gods of myth, monsters of legend, heroes and villains of lore.<br /><br />They’re real -- and they’re coming back to finish a war that’s been waged since the dawn of time.<br /><br />Fi Patterson and Zeke Prisco’s daily routine of caring for the elderly at a local hospital is shattered when a catatonic patient named Peter unwittingly thrusts them into a conflict between ageless beings beyond reckoning. A war of which he is the primary target, and perhaps the cause.<br /><br />In order to survive, Fi and Zeke must forget everything they know about the world and come to grips with the unimaginable reality of the <i>Firstborn</i>. Only then can they hope to learn the secrets locked in Peter’s mind, help stave off an ancient evil that’s been known by many names and feared by all, and discover truths about themselves perhaps best left hidden.<br /><br /><i>Paternus</i> is Dyrk Ashton’s debut novel, and the first book in the <i>Paternus Trilogy</i>.<br /><br /><b>Genre</b>: Contemporary Fantasy / Urban Fantasy / Mythic Fiction.<br /><br /><b>Market</b>: Adult to New Adult (as opposed to Teen or YA, though savvy 16 or 17 year olds might survive without permanent damage)."}},{"book":{"id":"18952341","title":"The Grace of Kings (The Dandelion Dynasty, #1)","numOfPages":"623","authors":"Ken Liu","link":"https://www.goodreads.com/book/show/18952341-the-grace-of-kings","imageUrl":"./images/18952341.jpg","publicationYear":"2015","averageRating":"3.75","ratingCount":"7152","description":"Two men rebel together against tyranny—and then become rivals—in this first sweeping book of an epic fantasy series from Ken Liu, recipient of Hugo, Nebula, and World Fantasy awards.<br /><br />Wily, charming Kuni Garu, a bandit, and stern, fearless Mata Zyndu, the son of a deposed duke, seem like polar opposites. Yet, in the uprising against the emperor, the two quickly become the best of friends after a series of adventures fighting against vast conscripted armies, silk-draped airships, and shapeshifting gods. Once the emperor has been overthrown, however, they each find themselves the leader of separate factions—two sides with very different ideas about how the world should be run and the meaning of justice.<br /><br />Fans of intrigue, intimate plots, and action will find a new series to embrace in the Dandelion Dynasty."}},{"book":{"id":"25744928","title":"Deep Work: Rules for Focused Success in a Distracted World","numOfPages":"296","authors":"Cal Newport","link":"https://www.goodreads.com/book/show/25744928-deep-work","imageUrl":"./images/25744928.jpg","publicationYear":"2016","averageRating":"4.19","ratingCount":"17752","description":"<b>One of the most valuable skills in our economy is becoming increasingly rare. If you master this skill, you'll achieve extraordinary results.</b><br /><br />Deep work is the ability to focus without distraction on a cognitively demanding task. It's a skill that allows you to quickly master complicated information and produce better results in less time. Deep work will make you better at what you do and provide the sense of true fulfillment that comes from craftsmanship. In short, deep work is like a super power in our increasingly competitive twenty-first century economy. And yet, most people have lost the ability to go deep-spending their days instead in a frantic blur of e-mail and social media, not even realizing there's a better way.<br /><br />In <i>Deep Work</i>, author and professor Cal Newport flips the narrative on impact in a connected age. Instead of arguing distraction is bad, he instead celebrates the power of its opposite. Dividing this book into two parts, he first makes the case that in almost any profession, cultivating a deep work ethic will produce massive benefits. He then presents a rigorous training regimen, presented as a series of four \"rules,\" for transforming your mind and habits to support this skill.<br /><br />A mix of cultural criticism and actionable advice, <i>Deep Work</i> takes the reader on a journey through memorable stories-from Carl Jung building a stone tower in the woods to focus his mind, to a social media pioneer buying a round-trip business class ticket to Tokyo to write a book free from distraction in the air-and no-nonsense advice, such as the claim that most serious professionals should quit social media and that you should practice being bored. <i>Deep Work</i> is an indispensable guide to anyone seeking focused success in a distracted world."}},{"book":{"id":"23692271","title":"Sapiens: A Brief History of Humankind","numOfPages":"443","authors":"Yuval Noah Harari","link":"https://www.goodreads.com/book/show/23692271-sapiens","imageUrl":"./images/23692271.jpg","publicationYear":"2014","averageRating":"4.43","ratingCount":"82400","description":"100,000 years ago, at least six human species inhabited the earth. Today there is just one. Us. Homo sapiens. <br /><br />How did our species succeed in the battle for dominance? Why did our foraging ancestors come together to create cities and kingdoms? How did we come to believe in gods, nations and human rights; to trust money, books and laws; and to be enslaved by bureaucracy, timetables and consumerism? And what will our world be like in the millennia to come? <br /><br />In <i>Sapiens</i>, Dr Yuval Noah Harari spans the whole of human history, from the very first humans to walk the earth to the radical – and sometimes devastating – breakthroughs of the Cognitive, Agricultural and Scientific Revolutions. Drawing on insights from biology, anthropology, paleontology and economics, he explores how the currents of history have shaped our human societies, the animals and plants around us, and even our personalities. Have we become happier as history has unfolded? Can we ever free our behaviour from the heritage of our ancestors? And what, if anything, can we do to influence the course of the centuries to come? <br /><br />Bold, wide-ranging and provocative, Sapiens challenges everything we thought we knew about being human: our thoughts, our actions, our power ... and our future."}}],"toRead":[{"book":{"id":"33280160","title":"What We Lose","numOfPages":"213","authors":"Zinzi Clemmons","imageUrl":"./images/33280160.jpg","link":"https://www.goodreads.com/book/show/33280160-what-we-lose","publicationYear":"2017","averageRating":"3.67","ratingCount":"2159","description":"From an author of rare, haunting power, a stunning novel about a young African-American woman coming of age—a deeply felt meditation on race, sex, family, and country<br /><br />Raised in Pennsylvania, Thandi views the world of her mother’s childhood in Johannesburg as both impossibly distant and ever present. She is an outsider wherever she goes, caught between being black and white, American and not. She tries to connect these dislocated pieces of her life, and as her mother succumbs to cancer, Thandi searches for an anchor—someone, or something, to love. <br /><br />In arresting and unsettling prose, we watch Thandi’s life unfold, from losing her mother and learning to live without the person who has most profoundly shaped her existence, to her own encounters with romance and unexpected motherhood. Through exquisite and emotional vignettes, Clemmons creates a stunning portrayal of what it means to choose to live, after loss. An elegiac distillation, at once intellectual and visceral, of a young woman’s understanding of absence and identity that spans continents and decades, What We Lose heralds the arrival of a virtuosic new voice in fiction."}},{"book":{"id":"7139892","title":"Under Heaven (Under Heaven, #1)","numOfPages":"573","authors":"Guy Gavriel Kay","imageUrl":"./images/7139892.jpg","link":"https://www.goodreads.com/book/show/7139892-under-heaven","publicationYear":"2010","averageRating":"4.13","ratingCount":"10663","description":"In Under Heaven, Kay tells a story of honor and power, this time in a setting that evokes the dazzling Tang Dynasty of eighth-century China. In recognition of his service to the Emperor of Kitai, Shen Tai has been sent a mysterious and dangerous gift: 250 Sardian horses. Wisely the gift comes with the stipulation that the horses must be claimed in person. Otherwise, he would probably be dead already."}},{"book":{"id":"954674","title":"Little Brother","numOfPages":"382","authors":"Cory Doctorow","imageUrl":"./images/954674.jpg","link":"https://www.goodreads.com/book/show/954674.Little_Brother","publicationYear":"","averageRating":"3.94","ratingCount":"40308","description":"Marcus aka “w1n5t0n,” is only seventeen years old, but he figures he already knows how the system works–and how to work the system. Smart, fast, and wise to the ways of the networked world, he has no trouble outwitting his high school’s intrusive but clumsy surveillance systems.<br /><br />But his whole world changes when he and his friends find themselves caught in the aftermath of a major terrorist attack on San Francisco. In the wrong place at the wrong time, Marcus and his crew are apprehended by the Department of Homeland Security and whisked away to a secret prison where they’re mercilessly interrogated for days.<br /><br />When the DHS finally releases them, his injured best friend Darryl does not come out. The city has become a police state where every citizen is treated like a potential terrorist. He knows that no one will believe his story, which leaves him only one option: \"M1k3y\" will take down the DHS himself."}},{"book":{"id":"25814413","title":"And Then All Hell Broke Loose: Two Decades in the Middle East","numOfPages":"241","authors":"Richard Engel","imageUrl":"./images/25814413.jpg","link":"https://www.goodreads.com/book/show/25814413-and-then-all-hell-broke-loose","publicationYear":"2016","averageRating":"4.20","ratingCount":"2640","description":"Based on two decades of reporting, NBC’s chief foreign correspondent’s riveting story of the Middle East revolutions, the Arab Spring, war, and terrorism seen up-close—sometimes dangerously so.<br /><br />When he was just twenty-three, a recent graduate of Stanford University, Richard Engel set off to Cairo with $2,000 and dreams of being a reporter. Shortly thereafter he was working freelance for Arab news sources and got a call that a busload of Italian tourists were massacred at a Cairo museum. This is his first view of the carnage these years would pile on. Over two decades Engel has been under fire, blown out of hotel beds, taken hostage. He has watched Mubarak and Morsi in Egypt arrested and condemned, reported from Jerusalem, been through the Lebanese war, covered the whole shooting match in Iraq, interviewed Libyan rebels who toppled Gaddafi, reported from Syria as Al-Qaeda stepped in, was kidnapped in the Syrian crosscurrents of fighting. He goes into Afghanistan with the Taliban and to Iraq with ISIS. In the page-turning <i>And Then All Hell Broke Loose</i>, he shares his adventure tale.<br /><br />Engel takes chances, though not reckless ones, keeps a level head and a sense of humor, as well as a grasp of history in the making. Reporting as NBC’s Chief-Foreign Correspondent, he reveals his unparalleled access to the major figures, the gritty soldiers, and the helpless victims in the Middle East during this watershed time. We can experience the unforgettable suffering and despair of the local populations. Engel’s vivid description is intimate and personal. Importantly, it is a succinct and authoritative account of the ever-changing currents in that dangerous land."}},{"book":{"id":"10836","title":"Che Guevara: A Revolutionary Life","numOfPages":"814","authors":"Jon Lee Anderson","imageUrl":"./images/10836.jpg","link":"https://www.goodreads.com/book/show/10836.Che_Guevara","publicationYear":"","averageRating":"4.10","ratingCount":"14376","description":"From the back of the book:<br /><br />\"Acclaimed around the world and a national best-seller, this is the definitive work on Che Guevara, the dashing rebel whose epic dream was to end poverty and injustice in Latin America and the developing world through armed revelation. Jon Lee Anderson's biography traces Che's extraordinary life, from his comfortable Argentine upbringing to the battlefields of the Cuban revolution, from the halls of power in Castro's government to his failed campaign in the Congo and assassination in the Bolivian Jungle.<br /><br />Anderson has had unprecedented access to the personal archives maintained by Guevara's window and carefully guarded Cuban government documents. He has conducted extensive interviews with Che's comarades-some of whom speak here for the first time-and with CIA men and Bolivian officers who hunted him down. Anderson broke the story of where Guevara's body was buried, which led to the exhumation and stat burial of the bones. Many of the details of Che's life have long been cloaked in secrecy and intrigue. Meticulously researched and full of exclusive information, Che Guevara illuminates as never before this mythic figure who embodied the high-water mark of revolutionary communism as a force in history.\""}},{"book":{"id":"66354","title":"Flow: The Psychology of Optimal Experience","numOfPages":"303","authors":"Mihaly Csikszentmihalyi","imageUrl":"./images/66354.jpg","link":"https://www.goodreads.com/book/show/66354.Flow","publicationYear":"1990","averageRating":"4.10","ratingCount":"33140","description":"The world's foremost producer of personal development and motivational audio programs gives you the tools to unleash the secret of peak performance.<br /><br />Remember the last time that you were so focused, so motivated that you felt at the absolute top of your form -- alert, energized and free of self-consciousness? Chances are you were experiencing flow -- an almost euphoric state of concentration and complete involvement.<br /><br />Now, esteemed psychologist Mihaly Csikszentmihalyi reveals how you can achieve this state of mind at will -- and turn everyday experience into a moment by moment opportunity for joy and self-fulfillment. Drawing on over 30 years of breakthrough research into what makes people satisfied, he explains the key elements of the flow experience"}},{"book":{"id":"33375622","title":"Her Body and Other Parties","numOfPages":"248","authors":"Carmen Maria Machado","imageUrl":"./images/33375622.jpg","link":"https://www.goodreads.com/book/show/33375622-her-body-and-other-parties","publicationYear":"2017","averageRating":"4.19","ratingCount":"638","description":"<b>A highly anticipated debut by one of the most ferociously gifted young writers working today (Michelle Huneven)</b><br /><br />In<i> Her Body and Other Parties</i>, Carmen Maria Machado blithely demolishes the arbitrary borders between psychological realism and science fiction, comedy and horror, fantasy and fabulism. While her work has earned her comparisons to Karen Russell and Kelly Link, she has a voice that is all her own. In this electric and provocative debut, Machado bends genre to shape startling narratives that map the realities of women's lives and the violence visited upon their bodies.<br /><br />A wife refuses her husband's entreaties to remove the green ribbon from around her neck. A woman recounts her sexual encounters as a plague slowly consumes humanity. A salesclerk in a mall makes a horrifying discovery within the seams of the store's prom dresses. One woman's surgery-induced weight loss results in an unwanted houseguest. And in the bravura novella Especially Heinous, Machado reimagines every episode of <i>Law &amp; Order: Special Victims Unit</i>, a show we naively assumed had shown it all, generating a phantasmagoric police procedural full of doppelgangers, ghosts, and girls with bells for eyes.<br /><br />Earthy and otherworldly, antic and sexy, queer and caustic, comic and deadly serious, <i>Her Body and Other Parties</i> swings from horrific violence to the most exquisite sentiment. In their explosive originality, these stories enlarge the possibilities of contemporary fiction."}},{"book":{"id":"17250961","title":"Oathbringer (The Stormlight Archive, #3)","numOfPages":"1008","authors":"Brandon Sanderson","imageUrl":"./images/17250961.jpg","link":"https://www.goodreads.com/book/show/17250961-oathbringer","publicationYear":"2017","averageRating":"4.61","ratingCount":"1042","description":"In Oathbringer, the third volume of the New York Times bestselling Stormlight Archive, humanity faces a new Desolation with the return of the Voidbringers, a foe with numbers as great as their thirst for vengeance.<br /><br />Dalinar Kholin’s Alethi armies won a fleeting victory at a terrible cost: The enemy Parshendi summoned the violent Everstorm, which now sweeps the world with destruction, and in its passing awakens the once peaceful and subservient parshmen to the horror of their millennia-long enslavement by humans. While on a desperate flight to warn his family of the threat, Kaladin Stormblessed must come to grips with the fact that the newly kindled anger of the parshmen may be wholly justified.<br /><br />Nestled in the mountains high above the storms, in the tower city of Urithiru, Shallan Davar investigates the wonders of the ancient stronghold of the Knights Radiant and unearths dark secrets lurking in its depths. And Dalinar realizes that his holy mission to unite his homeland of Alethkar was too narrow in scope. Unless all the nations of Roshar can put aside Dalinar’s blood-soaked past and stand together―and unless Dalinar himself can confront that past―even the restoration of the Knights Radiant will not prevent the end of civilization."}},{"book":{"id":"41793","title":"Hackers & Painters: Big Ideas from the Computer Age","numOfPages":"272","authors":"Paul Graham","imageUrl":"./images/41793.jpg","link":"https://www.goodreads.com/book/show/41793.Hackers_Painters","publicationYear":"2004","averageRating":"4.06","ratingCount":"6178","description":"“The computer world is like an intellectual Wild West, in which you can shoot anyone you wish with your ideas, if you’re willing to risk the consequences.” —from <cite>Hackers &amp; Painters: Big Ideas from the Computer Age</cite>, by Paul Graham<br /><br />We are living in the computer age, in a world increasingly designed and engineered by computer programmers and software designers, by people who call themselves hackers. Who are these people, what motivates them, and why should you care?<br /><br />Consider these facts: Everything around us is turning into computers. Your typewriter is gone, replaced by a computer. Your phone has turned into a computer. So has your camera. Soon your TV will. Your car was not only designed on computers, but has more processing power in it than a room-sized mainframe did in 1970. Letters, encyclopedias, newspapers, and even your local store are being replaced by the Internet.<br /><br /><cite>Hackers &amp; Painters: Big Ideas from the Computer Age</cite>, by Paul Graham, explains this world and the motivations of the people who occupy it. In clear, thoughtful prose that draws on illuminating historical examples, Graham takes readers on an unflinching exploration into what he calls “an intellectual Wild West.”<br /><br />The ideas discussed in this book will have a powerful and lasting impact on how we think, how we work, how we develop technology, and how we live. Topics include the importance of beauty in software design, how to make wealth, heresy and free speech, the programming language renaissance, the open-source movement, digital design, internet startups, and more."}},{"book":{"id":"20821614","title":"You (You, #1)","numOfPages":"422","authors":"Caroline Kepnes","imageUrl":"./images/20821614.jpg","link":"https://www.goodreads.com/book/show/20821614-you","publicationYear":"2014","averageRating":"3.83","ratingCount":"46161","description":"When a beautiful, aspiring writer strides into the East Village bookstore where Joe Goldberg works, he does what anyone would do: he Googles the name on her credit card.<br /><br />There is only one Guinevere Beck in New York City. She has a public Facebook account and Tweets incessantly, telling Joe everything he needs to know: she is simply Beck to her friends, she went to Brown University, she lives on Bank Street, and she’ll be at a bar in Brooklyn tonight—the perfect place for a “chance” meeting.<br /><br />As Joe invisibly and obsessively takes control of Beck’s life, he orchestrates a series of events to ensure Beck finds herself in his waiting arms. Moving from stalker to boyfriend, Joe transforms himself into Beck’s perfect man, all while quietly removing the obstacles that stand in their way—even if it means murder."}},{"book":{"id":"32487617","title":"Beneath a Scarlet Sky","numOfPages":"513","authors":"Mark T. Sullivan","imageUrl":"./images/32487617.jpg","link":"https://www.goodreads.com/book/show/32487617-beneath-a-scarlet-sky","publicationYear":"2017","averageRating":"4.44","ratingCount":"44188","description":"Based on the true story of a forgotten hero, <i>Beneath a Scarlet Sky</i> is the triumphant, epic tale of one young man’s incredible courage and resilience during one of history’s darkest hours.<br /><br />Pino Lella wants nothing to do with the war or the Nazis. He’s a normal Italian teenager—obsessed with music, food, and girls—but his days of innocence are numbered. When his family home in Milan is destroyed by Allied bombs, Pino joins an underground railroad helping Jews escape over the Alps, and falls for Anna, a beautiful widow six years his senior.<br /><br />In an attempt to protect him, Pino’s parents force him to enlist as a German soldier—a move they think will keep him out of combat. But after Pino is injured, he is recruited at the tender age of eighteen to become the personal driver for Adolf Hitler’s left hand in Italy, General Hans Leyers, one of the Third Reich’s most mysterious and powerful commanders.<br /><br />Now, with the opportunity to spy for the Allies inside the German High Command, Pino endures the horrors of the war and the Nazi occupation by fighting in secret, his courage bolstered by his love for Anna and for the life he dreams they will one day share."}},{"book":{"id":"28921","title":"The Remains of the Day","numOfPages":"258","authors":"Kazuo Ishiguro","imageUrl":"./images/28921.jpg","link":"https://www.goodreads.com/book/show/28921.The_Remains_of_the_Day","publicationYear":"2005","averageRating":"4.10","ratingCount":"125446","description":"In the summer of 1956, Stevens, a long-serving butler at Darlington Hall, decides to take a motoring trip through the West Country. The six-day excursion becomes a journey into the past of Stevens and England, a past that takes in fascism, two world wars, and an unrealised love between the butler and his housekeeper."}},{"book":{"id":"4373","title":"First They Killed My Father: A Daughter of Cambodia Remembers","numOfPages":"238","authors":"Loung Ung","imageUrl":"./images/4373.jpg","link":"https://www.goodreads.com/book/show/4373.First_They_Killed_My_Father","publicationYear":"2006","averageRating":"4.30","ratingCount":"19910","description":"Chronicles the brutality of the Khmer Rouge in Cambodia, from the author's forced ''evacuation'' of Phnom Penh in 1975 to her family's subsequent movements from town to town and eventual separation."}},{"book":{"id":"23007551","title":"Construct","numOfPages":"359","authors":"Luke Matthews","imageUrl":"./images/23007551.jpg","link":"https://www.goodreads.com/book/show/23007551-construct","publicationYear":"2014","averageRating":"4.14","ratingCount":"36","description":"The essence of every construct resides in their core. A fist-sized stone, carefully saturated with <em>khet</em>, mounted in a walking shell – the vessel through which experience will shape them. Wipe a construct’s core – strip all that away – and what’s left? <br /><br />It’s a quandary that now haunts Samuel’s every step. Hundreds of years of life – the chronicle of his experience – taken from him. All that he once was, replaced by visions of a gruesome murder, the piercing silver eyes of a ruthless hunter, and premonitions of his own destruction. All of it punctuated by the one thing that no construct is supposed to be capable of: emotion. <br /><br />Relentlessly pursued and adrift in a world that sees constructs as little more than property, Samuel now faces the hardest challenge of all – knowing who to trust."}},{"book":{"id":"32075854","title":"Magpie Murders","numOfPages":"496","authors":"Anthony Horowitz","imageUrl":"./images/32075854.jpg","link":"https://www.goodreads.com/book/show/32075854-magpie-murders","publicationYear":"2017","averageRating":"3.98","ratingCount":"12303","description":"When editor Susan Ryeland is given the manuscript of Alan Conway’s latest novel, she has no reason to think it will be much different from any of his others. After working with the bestselling crime writer for years, she’s intimately familiar with his detective, Atticus Pünd, who solves mysteries disturbing sleepy English villages. An homage to queens of classic British crime such as Agatha Christie and Dorothy Sayers, Alan’s traditional formula has proved hugely successful. So successful that Susan must continue to put up with his troubling behavior if she wants to keep her job.<br /><br />Conway’s latest tale has Atticus Pünd investigating a murder at Pye Hall, a local manor house. Yes, there are dead bodies and a host of intriguing suspects, but the more Susan reads, the more she’s convinced that there is another story hidden in the pages of the manuscript: one of real-life jealousy, greed, ruthless ambition, and murder."}},{"book":{"id":"4360","title":"My War Gone By, I Miss It So","numOfPages":"336","authors":"Anthony Loyd","imageUrl":"./images/4360.jpg","link":"https://www.goodreads.com/book/show/4360.My_War_Gone_By_I_Miss_It_So","publicationYear":"2001","averageRating":"4.28","ratingCount":"1355","description":"Nothing can prepare you for <b>Anthony Loyd</b>'s portrait of war. It is the story of the unspeakable terror and the visceral, ecstatic thrill of combat, and the lives and dreams laid to waste by the bloodiest conflict that Europe has witnessed since the Second World War. Born into a distinguished military family, Loyd was raised on the stories of his ancestors' exploits and grew up fascinated with war. Unsatisfied by a brief career in the British Army, he set out for the killing fields in Bosnia. It was there--in the midst of the roar of battle and the life-and-death struggle among the Serbs, Croatians, and Bosnian Muslims--that he would discover humanity at its worst and best. Profoundly shocking, poetic, and ultimately redemptive, this is an uncompromising look at the brutality of war and its terrifyingly seductive power."}},{"book":{"id":"68498","title":"King Rat","numOfPages":"320","authors":"China Miéville","imageUrl":"./images/68498.jpg","link":"https://www.goodreads.com/book/show/68498.King_Rat","publicationYear":"2000","averageRating":"3.54","ratingCount":"7221","description":"<div>Something is stirring in London's dark, stamping out its territory in brickdust and blood. Something has murdered Saul Garamond's father, and left Saul to pay for the crime.<br /><br />But a shadow from the urban waste breaks into Saul's prison cell and leads him to freedom. A shadow called King Rat, who reveals Saul's royal heritage, a heritage that opens a new world to Saul, the world below London's streets--a heritage that also drags Saul into King Rat's plan for revenge against his ancient enemy,. With drum 'n' bass pounding the backstreets, Saul must confront the forces that would use him, the forces that would destroy him, and the forces that shape his own bizarre identity.<br /></div>"}},{"book":{"id":"9533378","title":"Hounded (The Iron Druid Chronicles, #1)","numOfPages":"292","authors":"Kevin Hearne","imageUrl":"./images/9533378.jpg","link":"https://www.goodreads.com/book/show/9533378-hounded","publicationYear":"2011","averageRating":"4.12","ratingCount":"58397","description":"Atticus O’Sullivan, last of the Druids, lives peacefully in Arizona, running an occult bookshop and shape-shifting in his spare time to hunt with his Irish wolfhound. His neighbors and customers think that this handsome, tattooed Irish dude is about twenty-one years old—when in actuality, he’s twenty-one centuries old. Not to mention: He draws his power from the earth, possesses a sharp wit, and wields an even sharper magical sword known as Fragarach, the Answerer.<br /><br />Unfortunately, a very angry Celtic god wants that sword, and he’s hounded Atticus for centuries. Now the determined deity has tracked him down, and Atticus will need all his power—plus the help of a seductive goddess of death, his vampire and werewolf team of attorneys, a bartender possessed by a Hindu witch, and some good old-fashioned luck of the Irish—to kick some Celtic arse and deliver himself from evil."}},{"book":{"id":"23848190","title":"Extreme Ownership: How U.S. Navy SEALs Lead and Win","numOfPages":"320","authors":"Jocko Willink","imageUrl":"./images/23848190.jpg","link":"https://www.goodreads.com/book/show/23848190-extreme-ownership","publicationYear":"2015","averageRating":"4.29","ratingCount":"7067","description":"The #1 <i>New York Times </i>bestseller<br /><br />\"An incredible book... you teach guys and gals about leadership and you've helped not only military guys but families.\" - Megyn Kelly<br /><br />\"You show in the book how to motivate... thanks for writing the book Extreme Ownership.\" Bill O'Reilly<br /><br />\"[Jocko] is the co-author of an incredible new book - which I've been loving. Trust me. Buy it.\" - Tim Ferriss<br /><br />\"This is a life-learning lesson for everyone... the book is awesome.\" - Sean Hannity<br /><br />Sent to the most violent battlefield in Iraq, Jocko Willink and Leif Babin’s SEAL task unit faced a seemingly impossible mission: help U.S. forces secure Ramadi, a city deemed “all but lost.” In gripping firsthand accounts of heroism, tragic loss, and hard-won victories in SEAL Team Three’s Task Unit Bruiser, they learned that leadership—at every level—is the most important factor in whether a team succeeds or fails.Willink and Babin returned home from deployment and instituted SEAL leadership training that helped forge the next generation of SEAL leaders. After departing the SEAL Teams, they launched Echelon Front, a company that teaches these same leadership principles to businesses and organizations. From promising startups to Fortune 500 companies, Babin and Willink have helped scores of clients across a broad range of industries build their own high-performance teams and dominate their battlefields.<br />Now, detailing the mind-set and principles that enable SEAL units to accomplish the most difficult missions in combat, <i>Extreme Ownership</i> shows how to apply them to any team, family or organization. Each chapter focuses on a specific topic such as Cover and Move, Decentralized Command, and Leading Up the Chain, explaining what they are, why they are important, and how to implement them in any leadership environment.<br />A compelling narrative with powerful instruction and direct application, <i>Extreme Ownership</i> revolutionizes business management and challenges leaders everywhere to fulfill their ultimate purpose: lead and win."}},{"book":{"id":"31450633","title":"The Breakdown","numOfPages":"328","authors":"B.A. Paris","imageUrl":"./images/31450633.jpg","link":"https://www.goodreads.com/book/show/31450633-the-breakdown","publicationYear":"2017","averageRating":"3.97","ratingCount":"20555","description":"<i>If you can’t trust yourself, who can you trust?</i><br /><br />Cass is having a hard time since the night she saw the car in the woods, on the winding rural road, in the middle of a downpour, with the woman sitting inside―the woman who was killed. She’s been trying to put the crime out of her mind; what could she have done, really? It’s a dangerous road to be on in the middle of a storm. Her husband would be furious if he knew she’d broken her promise not to take that shortcut home. And she probably would only have been hurt herself if she’d stopped.<br /><br />But since then, she’s been forgetting every little thing: where she left the car, if she took her pills, the alarm code, why she ordered a pram when she doesn’t have a baby.<br /><br />The only thing she can’t forget is that woman, the woman she might have saved, and the terrible nagging guilt.<br /><br />Or the silent calls she’s receiving, or the feeling that someone’s watching her…"}},{"book":{"id":"22878967","title":"The Shadow of What Was Lost (The Licanius Trilogy, #1)","numOfPages":"602","authors":"James Islington","imageUrl":"./images/22878967.jpg","link":"https://www.goodreads.com/book/show/22878967-the-shadow-of-what-was-lost","publicationYear":"2014","averageRating":"4.16","ratingCount":"9177","description":"<em>It has been twenty years since the end of the war. The dictatorial Augurs - once thought of almost as gods - were overthrown and wiped out during the conflict, their much-feared powers mysteriously failing them. Those who had ruled under them, men and women with a lesser ability known as the Gift, avoided the Augurs' fate only by submitting themselves to the rebellion's Four Tenets. A representation of these laws is now written into the flesh of any who use the Gift, forcing those so marked into absolute obedience.</em><br /><br />As a student of the Gifted, Davian suffers the consequences of a war fought – and lost – before he was born. Despised by most beyond the school walls, he and those around him are all but prisoners as they attempt to learn control of the Gift. Worse, as Davian struggles with his lessons, he knows that there is further to fall if he cannot pass his final tests. <br /><br />But when Davian discovers he has the ability to wield the forbidden power of the Augurs, he sets into motion a chain of events that will change everything. To the north, an ancient enemy long thought defeated begins to stir. And to the west, a young man whose fate is intertwined with Davian’s wakes up in the forest, covered in blood and with no memory of who he is…"}},{"book":{"id":"6570928","title":"The Total Money Makeover Workbook","numOfPages":"","authors":"Dave Ramsey","imageUrl":"./images/6570928.jpg","link":"https://www.goodreads.com/book/show/6570928-the-total-money-makeover-workbook","publicationYear":"","averageRating":"4.30","ratingCount":"1737","description":""}},{"book":{"id":"30189669","title":"Gunmetal Gray (Gray Man, #6)","numOfPages":"","authors":"Mark Greaney","imageUrl":"./images/30189669.jpg","link":"https://www.goodreads.com/book/show/30189669-gunmetal-gray","publicationYear":"2017","averageRating":"4.40","ratingCount":"2859","description":"<b>\n  <blockquote>Mark Greaney, the #1 <i>New York Times</i> bestselling co-author of Tom Clancy's Jack Ryan novels, delivers another breakneck thriller following the world's deadliest assassin the Gray Man.</blockquote>\n</b>After five years on the run Court Gentry is back on the inside at the CIA. But his first mission makes him wish he had stayed on the outs when a pair of Chinese agents try to take him down in Hong Kong. Normally the Chinese prefer to stay eyes-only on foreign agents. So why are they on such high alert?<p>Court's high stakes hunt for answers takes him across Southeast Asia and leads to his old friend, Donald Fitzroy, who is being held hostage by the Chinese. Fitzroy was contracted to find Fan Jiang, a former member of an ultra-secret computer warfare unit responsible for testing China's own security systems. And it seems Fan may have been too good at his job because China wants him dead.</p><p>The first two kill teams Fitzroy sent to find Fan have disappeared and the Chinese have decided to supervise the next operation. What they don't know is that Gentry's mission is to find Fan first and get whatever intel he has to the US.</p><p>After that, all he has to do is get out alive...</p><p><b>“I Love the Gray Man.”</b>—#1 <i>New York Times</i> bestselling author Lee Child</p><p><b>“Bourne for the new millenium.”</b>—<i>New York Times</i> bestselling author James Rollins</p><p><b>“Mark Greaney reigns as one of the recognized masters of action and adventure. Back Blast is no exception.”</b>—<i>New York Times</i> and #1 internationally bestselling author Steve Berry</p><p><b>“Fast-paced [and] tightly written...A great ride.”</b>—<i>New York Times</i> bestselling author Larry Bond</p><p><b>“Punches with bone-busting power…Flesh-and-blood priceless.”</b>—<i>New York Times</i> bestselling author Stephen Templin</p><p><b>“Greaney’s unraveling of the Back Blast mystery is masterly, but it’s the Gray Man’s ability to outthink and outgun...that will keep readers glued to the pages.”</b>—<i>Publishers Weekly</i> (starred review)</p><p><b>“[A] high-energy thriller...Clancy fans will have a blast.”</b>—<i>Kirkus Reviews</i></p>"}},{"book":{"id":"28525188","title":"Columbus Day (Expeditionary Force, #1)","numOfPages":"","authors":"Craig Alanson","imageUrl":"./images/28525188.jpg","link":"https://www.goodreads.com/book/show/28525188-columbus-day","publicationYear":"","averageRating":"4.24","ratingCount":"4398","description":"<i>Alternate Cover Edition can be found <a href=\"https://www.goodreads.com/book/show/36335767-columbus-day\" rel=\"nofollow\">here</a>. </i><br /><br />We were fighting on the wrong side, of a war we couldn't win. And that was the good news. <br />The Ruhar hit us on Columbus Day. There we were, innocently drifting along the cosmos on our little blue marble, like the native Americans in 1492. Over the horizon come ships of a technologically advanced, aggressive culture, and BAM! There go the good old days, when humans only got killed by each other. So, Columbus Day. It fits. <br />When the morning sky twinkled again, this time with Kristang starships jumping in to hammer the Ruhar, we thought we were saved. The UN Expeditionary Force hitched a ride on Kristang ships to fight the Ruhar, wherever our new allies thought we could be useful. So, I went from fighting with the US Army in Nigeria, to fighting in space. It was lies, all of it. We shouldn't even be fighting the Ruhar, they aren't our enemy, our allies are. <br />I'd better start at the beginning...."}},{"book":{"id":"25499718","title":"Children of Time","numOfPages":"600","authors":"Adrian Tchaikovsky","imageUrl":"./images/25499718.jpg","link":"https://www.goodreads.com/book/show/25499718-children-of-time","publicationYear":"2015","averageRating":"4.30","ratingCount":"10069","description":"A race for survival among the stars... Humanity's last survivors escaped earth's ruins to find a new home. But when they find it, can their desperation overcome its dangers?<br /><br />WHO WILL INHERIT THIS NEW EARTH?<br /><br />The last remnants of the human race left a dying Earth, desperate to find a new home among the stars. Following in the footsteps of their ancestors, they discover the greatest treasure of the past age - a world terraformed and prepared for human life.<br /><br />But all is not right in this new Eden. In the long years since the planet was abandoned, the work of its architects has borne disastrous fruit. The planet is not waiting for them, pristine and unoccupied. New masters have turned it from a refuge into mankind's worst nightmare.<br /><br />Now two civilizations are on a collision course, both testing the boundaries of what they will do to survive. As the fate of humanity hangs in the balance, who are the true heirs of this new Earth?"}},{"book":{"id":"518848","title":"Sabriel (Abhorsen,  #1)","numOfPages":"491","authors":"Garth Nix","imageUrl":"./images/518848.jpg","link":"https://www.goodreads.com/book/show/518848.Sabriel","publicationYear":"1996","averageRating":"4.17","ratingCount":"147855","description":"Sent to a boarding school in Ancelstierre as a young child, Sabriel has had little experience with the random power of Free Magic or the Dead who refuse to stay dead in the Old Kingdom. But during her final semester, her father, the Abhorsen, goes missing, and Sabriel knows she must enter the Old Kingdom to find him. <br /><br />With Sabriel, the first installment in the Abhorsen series, Garth Nix exploded onto the fantasy scene as a rising star, in a novel that takes readers to a world where the line between the living and the dead isn't always clear—and sometimes disappears altogether."}},{"book":{"id":"29906980","title":"Lincoln in the Bardo","numOfPages":"343","authors":"George Saunders","imageUrl":"./images/29906980.jpg","link":"https://www.goodreads.com/book/show/29906980-lincoln-in-the-bardo","publicationYear":"2017","averageRating":"3.90","ratingCount":"29911","description":"The captivating first novel by the best-selling, National Book Award nominee George Saunders, about Abraham Lincoln and the death of his eleven year old son, Willie, at the dawn of the Civil War<br /><br />On February 22, 1862, two days after his death, Willie Lincoln was laid to rest in a marble crypt in a Georgetown cemetery. That very night, shattered by grief, Abraham Lincoln arrives at the cemetery under cover of darkness and visits the crypt, alone, to spend time with his son’s body. <br /><br />Set over the course of that one night and populated by ghosts of the recently passed and the long dead, <i>Lincoln in the Bardo</i> is a thrilling exploration of death, grief, the powers of good and evil, a novel - in its form and voice - completely unlike anything you have read before. It is also, in the end, an exploration of the deeper meaning and possibilities of life, written as only George Saunders can: with humor, pathos, and grace."}},{"book":{"id":"13539191","title":"Three Parts Dead (Craft Sequence, #1)","numOfPages":"336","authors":"Max Gladstone","imageUrl":"./images/13539191.jpg","link":"https://www.goodreads.com/book/show/13539191-three-parts-dead","publicationYear":"2012","averageRating":"3.98","ratingCount":"8341","description":"A god has died, and it’s up to Tara, first-year associate in the international necromantic firm of Kelethres, Albrecht, and Ao, to bring Him back to life before His city falls apart.<br /><br />Her client is Kos, recently deceased fire god of the city of Alt Coulumb. Without Him, the metropolis’s steam generators will shut down, its trains will cease running, and its four million citizens will riot.<br /><br />Tara’s job: resurrect Kos before chaos sets in. Her only help: Abelard, a chain-smoking priest of the dead god, who’s having an understandable crisis of faith.<br /><br />When Tara and Abelard discover that Kos was murdered, they have to make a case in Alt Coulumb’s courts—and their quest for the truth endangers their partnership, their lives, and Alt Coulumb’s slim hope of survival.<br /><br />Set in a phenomenally built world in which justice is a collective force bestowed on a few, craftsmen fly on lightning bolts, and gargoyles can rule cities, <i>Three Parts Dead</i> introduces readers to an ethical landscape in which the line between right and wrong blurs."}},{"book":{"id":"34517","title":"Reaper Man (Discworld, #11; Death, #2)","numOfPages":"352","authors":"Terry Pratchett","imageUrl":"./images/34517.jpg","link":"https://www.goodreads.com/book/show/34517.Reaper_Man","publicationYear":"2005","averageRating":"4.27","ratingCount":"63823","description":"<i>'Death has to happen. That's what bein' alive is all about. You're alive, and then you're dead. It can't just stop happening.'</i><br /><br />But it can. And it has. So what happens after death is now less of a philosophical question than a question of actual reality. On the Disc, as here, they need Death. If Death doesn't come for you, then what are you supposed to do in the meantime? You can't have the undead wandering about like lost souls. There's no telling what might happen, particularly when they discover that life really is only for the living..."}},{"book":{"id":"589979","title":"Daughter of the Empire (The Empire Trilogy, #1)","numOfPages":"421","authors":"Raymond E. Feist","imageUrl":"./images/589979.jpg","link":"https://www.goodreads.com/book/show/589979.Daughter_of_the_Empire","publicationYear":"1988","averageRating":"4.24","ratingCount":"26158","description":"Magic and murder engulf the realm of Kelewan.  Fierce warlords ignite a bitter blood feud to enslave the empire of Tsuranuanni.  While in the opulent Imperial courts, assassins and spy-master plot cunning and devious intrigues against the rightful heir.  Now Mara, a young, untested Ruling lady, is called upon to lead her people in a heroic struggle for survival.  But first she must rally an army of rebel warriors, form a pact with the alien cho-ja, and marry the son of a hated enemy.  Only then can Mara face her most dangerous foe of all--in his own impregnable stronghold.  An epic tale of adventure and intrigue.  Daughter of the Empire is fantasy of the highest order by two of the most talented writers in the field today."}},{"book":{"id":"13616278","title":"The Red Knight (The Traitor Son Cycle, #1)","numOfPages":"650","authors":"Miles  Cameron","imageUrl":"./images/13616278.jpg","link":"https://www.goodreads.com/book/show/13616278-the-red-knight","publicationYear":"2012","averageRating":"4.12","ratingCount":"10450","description":"Twenty eight florins a month is a huge price to pay, for a man to stand between you and the Wild.<br /><br />Twenty eight florins a month is nowhere near enough when a wyvern's jaws snap shut on your helmet in the hot stink of battle, and the beast starts to rip the head from your shoulders. But if standing and fighting is hard, leading a company of men - or worse, a company of mercenaries - against the smart, deadly creatures of the Wild is even harder.<br /><br />It takes all the advantages of birth, training, and the luck of the devil to do it.<br /><br />The Red Knight has all three, he has youth on his side, and he's determined to turn a profit. So when he hires his company out to protect an Abbess and her nunnery, it's just another job. The abby is rich, the nuns are pretty and the monster preying on them is nothing he can't deal with.<br /><br />Only it's not just a job. It's going to be a war..."}},{"book":{"id":"27883214","title":"Caraval (Caraval, #1)","numOfPages":"407","authors":"Stephanie Garber","imageUrl":"./images/27883214.jpg","link":"https://www.goodreads.com/book/show/27883214-caraval","publicationYear":"2017","averageRating":"3.96","ratingCount":"41502","description":"<i>Remember, it’s only a game…</i><br /><br />Scarlett Dragna has never left the tiny island where she and her sister, Tella, live with their powerful, and cruel, father. Now Scarlett’s father has arranged a marriage for her, and Scarlett thinks her dreams of seeing Caraval—the faraway, once-a-year performance where the audience participates in the show—are over.<br /><br />But this year, Scarlett’s long-dreamt-of invitation finally arrives. With the help of a mysterious sailor, Tella whisks Scarlett away to the show. Only, as soon as they arrive, Tella is kidnapped by Caraval’s mastermind organizer, Legend. It turns out that this season’s Caraval revolves around Tella, and whoever finds her first is the winner.<br /><br />Scarlett has been told that everything that happens during Caraval is only an elaborate performance. Nevertheless she becomes enmeshed in a game of love, heartbreak, and magic. And whether Caraval is real or not, Scarlett must find Tella before the five nights of the game are over or a dangerous domino effect of consequences will be set off, and her beloved sister will disappear forever.<br /><br /><i>Welcome, welcome to Caraval…beware of getting swept too far away.</i>"}},{"book":{"id":"929782","title":"Martin Eden","numOfPages":"480","authors":"Jack London","imageUrl":"./images/929782.jpg","link":"https://www.goodreads.com/book/show/929782.Martin_Eden","publicationYear":"1994","averageRating":"4.39","ratingCount":"15472","description":"The semiautobiographical <em>Martin Eden</em> is the most vital and original character Jack London ever created. Set in San Francisco, this is the story of Martin Eden, an impoverished seaman who pursues, obsessively and aggressively, dreams of education and literary fame. London, dissatisfied with the rewards of his own success, intended Martin Eden as an attack on individualism and a criticism of ambition; however, much of its status as a classic has been conferred by admirers of its ambitious protagonist.<br /><br />Andrew Sinclair's wide-ranging introduction discusses the conflict between London's support of socialism and his powerful self-will. Sinclair also explores the parallels and divergences between the life of Martin Eden and that of his creator, focusing on London's mental depressions and how they affected his depiction of Eden."}},{"book":{"id":"23602562","title":"Our Souls at Night","numOfPages":"179","authors":"Kent Haruf","imageUrl":"./images/23602562.jpg","link":"https://www.goodreads.com/book/show/23602562-our-souls-at-night","publicationYear":"2015","averageRating":"3.96","ratingCount":"36455","description":"A spare yet eloquent, bittersweet yet inspiring story of a man and a woman who, in advanced age, come together to wrestle with the events of their lives and their hopes for the imminent future.<br /><br />In the familiar setting of Holt, Colorado, home to all of Kent Haruf's inimitable fiction, Addie Moore pays an unexpected visit to a neighbor, Louis Waters. Her husband died years ago, as did his wife, and in such a small town they naturally have known of each other for decades; in fact, Addie was quite fond of Louis's wife. His daughter lives hours away in Colorado Springs, her son even farther away in Grand Junction, and Addie and Louis have long been living alone in houses now empty of family, the nights so terribly lonely, especially with no one to talk with. <br /><br />Their brave adventures - their pleasures and their difficulties - are hugely involving and truly resonant, making Our Souls at Night the perfect final installment to this beloved writer's enduring contribution to American literature."}},{"book":{"id":"68527","title":"The Last Kingdom (The Saxon Stories, #1)","numOfPages":"368","authors":"Bernard Cornwell","imageUrl":"./images/68527.jpg","link":"https://www.goodreads.com/book/show/68527.The_Last_Kingdom","publicationYear":"2006","averageRating":"4.23","ratingCount":"48315","description":"This is the story of the making of England in the 9th and 10th centuries, the years in which King Alfred the Great, his son and grandson defeated the Danish Vikings who had invaded and occupied three of England’s four kingdoms.<br /><br />The story is seen through the eyes of Uhtred, a dispossessed nobleman, who is captured as a child by the Danes and then raised by them so that, by the time the Northmen begin their assault on Wessex (Alfred’s kingdom and the last territory in English hands) Uhtred almost thinks of himself as a Dane. He certainly has no love for Alfred, whom he considers a pious weakling and no match for Viking savagery, yet when Alfred unexpectedly defeats the Danes and the Danes themselves turn on Uhtred, he is finally forced to choose sides. By now he is a young man, in love, trained to fight and ready to take his place in the dreaded shield wall. Above all, though, he wishes to recover his father’s land, the enchanting fort of Bebbanburg by the wild northern sea.<br /><br />This thrilling adventure—based on existing records of Bernard Cornwell’s ancestors—depicts a time when law and order were ripped violently apart by a pagan assault on Christian England, an assault that came very close to destroying England."}},{"book":{"id":"30841984","title":"Kings of the Wyld (The Band, #1)","numOfPages":"502","authors":"Nicholas Eames","imageUrl":"./images/30841984.jpg","link":"https://www.goodreads.com/book/show/30841984-kings-of-the-wyld","publicationYear":"2017","averageRating":"4.42","ratingCount":"2898","description":"<i>Glory never gets old</i><br /><br /> Clay Cooper and his band were once the best of the best -- the meanest, dirtiest, most feared crew of mercenaries this side of the Heartwyld. <br /><br />Their glory days long past, the mercs have grown apart and grown old, fat, drunk - or a combination of the three. Then an ex-bandmate turns up at Clay's door with a plea for help. His daughter Rose is trapped in a city besieged by an enemy one hundred thousand strong and hungry for blood. Rescuing Rose is the kind of mission that only the very brave or the very stupid would sign up for.<br /><br />It's time to get the band back together for one last tour across the Wyld."}},{"book":{"id":"15771846","title":"Mage's Blood (Moontide Quartet, #1)","numOfPages":"671","authors":"David Hair","imageUrl":"./images/15771846.jpg","link":"https://www.goodreads.com/book/show/15771846-mage-s-blood","publicationYear":"2012","averageRating":"3.86","ratingCount":"2923","description":"The Moontide Bridge lies deep below the sea, but every 12 years the tides sink and the bridge is revealed, its gates open for trade. The Magi are hell-bent on ruling this world and have led armies across the bridge on crusades of conquest. Now the Moontide is almost here and the people of the East are ready to fight."}},{"book":{"id":"30145126","title":"The Lost City of the Monkey God: A True Story","numOfPages":"328","authors":"Douglas Preston","imageUrl":"./images/30145126.jpg","link":"https://www.goodreads.com/book/show/30145126-the-lost-city-of-the-monkey-god","publicationYear":"2017","averageRating":"3.92","ratingCount":"10898","description":"<b>A five-hundred-year-old legend. An ancient curse. A stunning medical mystery. And a pioneering journey into the unknown heart of the world's densest jungle.</b><br /><br />Since the days of conquistador Hernán Cortés, rumors have circulated about a lost city of immense wealth hidden somewhere in the Honduran interior, called the White City or the Lost City of the Monkey God. Indigenous tribes speak of ancestors who fled there to escape the Spanish invaders, and they warn that anyone who enters this sacred city will fall ill and die. In 1940, swashbuckling journalist Theodore Morde returned from the rainforest with hundreds of artifacts and an electrifying story of having found the Lost City of the Monkey God-but then committed suicide without revealing its location.<br /><br />Three quarters of a century later, bestselling author Doug Preston joined a team of scientists on a groundbreaking new quest. In 2012 he climbed aboard a rickety, single-engine plane carrying the machine that would change everything: lidar, a highly advanced, classified technology that could map the terrain under the densest rainforest canopy. In an unexplored valley ringed by steep mountains, that flight revealed the unmistakable image of a sprawling metropolis, tantalizing evidence of not just an undiscovered city but an enigmatic, lost civilization.<br /><br />Venturing into this raw, treacherous, but breathtakingly beautiful wilderness to confirm the discovery, Preston and the team battled torrential rains, quickmud, disease-carrying insects, jaguars, and deadly snakes. But it wasn't until they returned that tragedy struck: Preston and others found they had contracted in the ruins a horrifying, sometimes lethal-and incurable-disease.<br /><br />Suspenseful and shocking, filled with colorful history, hair-raising adventure, and dramatic twists of fortune, <i>The Lost City of the Monkey God</i> is the absolutely true, eyewitness account of one of the great discoveries of the twenty-first century."}},{"book":{"id":"23899193","title":"Saint's Blood (Greatcoats, #3)","numOfPages":"576","authors":"Sebastien de Castell","imageUrl":"./images/23899193.jpg","link":"https://www.goodreads.com/book/show/23899193-saint-s-blood","publicationYear":"2016","averageRating":"4.32","ratingCount":"2908","description":"<p>How do you kill a Saint?</p><p>Falcio, Kest, and Brasti are about to find out, because someone has figured out a way to do it and they've started with a friend.</p><p>The Dukes were already looking for ways out of their agreement to put Aline on the throne, but with the Saints turning up dead, rumours are spreading that the Gods themselves oppose her ascension. Now churches are looking to protect themselves by bringing back the military orders of religious soldiers, assassins, and (especially) Inquisitors - a move that could turn the country into a theocracy. The only way Falcio can put a stop to it is by finding the murderer. He has only one clue: a terrifying iron mask which makes the Saints vulnerable by driving them mad. But even if he can find the killer, he'll still have to face him in battle.</p><p>And that may be a duel that no swordsman, no matter how skilled, can hope to win.</p>"}},{"book":{"id":"25972177","title":"The Waking Fire (The Draconis Memoria, #1)","numOfPages":"592","authors":"Anthony  Ryan","imageUrl":"./images/25972177.jpg","link":"https://www.goodreads.com/book/show/25972177-the-waking-fire","publicationYear":"2016","averageRating":"4.11","ratingCount":"5073","description":"The Waking Fire is set in a vibrant new world where the blood of drakes—creatures similar to dragons—is valued beyond reckoning, and can be distilled into elixirs that grant fearsome powers to those who are “blood-blessed.” The novel follows an unregistered blood-blessed as he searches for an elusive variety of drake so potent, its capture would mean unrivalled riches; the second in command of a blood-burning ironclad ship; and a young woman in a lifelong contract to a trading syndicate, whose espionage mission places her on the front lines of a newly declared war. As empires clash and arcane mysteries reveal themselves, these characters are tested again and again and soon discover that the fate of the world rests on their shoulders.<br /><br />The Draconis Memoria is a remarkable new epic fantasy series with steampunk flavor, full of the phenomenal worldbuilding and non-stop action that have gained Anthony Ryan a global fan base."}},{"book":{"id":"13543121","title":"Between Two Fires","numOfPages":"432","authors":"Christopher Buehlman","imageUrl":"./images/13543121.jpg","link":"https://www.goodreads.com/book/show/13543121-between-two-fires","publicationYear":"2012","averageRating":"4.01","ratingCount":"1304","description":"His extraordinary debut, <i>Those Across the River</i>, was hailed as “genre-bending Southern horror” (<i>California Literary Review</i>), “graceful [and] horrific” (Patricia Briggs). Now Christopher Buehlman invites readers into an even darker age—one of temptation and corruption, of war in heaven, and of hell on earth… <br /><br />And Lucifer said: “<i>Let us rise against Him now in all our numbers, and pull the walls of heaven down…” </i><br /><br />The year is 1348. Thomas, a disgraced knight, has found a young girl alone in a dead Norman village. An orphan of the Black Death, and an almost unnerving picture of innocence, she tells Thomas that plague is only part of a larger cataclysm—that the fallen angels under Lucifer are rising in a second war on heaven, and that the world of men has fallen behind the lines of conflict. <br /><br />Is it delirium or is it faith? She believes she has seen the angels of God. She believes the righteous dead speak to her in dreams. And now she has convinced the faithless Thomas to shepherd her across a depraved landscape to Avignon. There, she tells Thomas, she will fulfill her mission: to confront the evil that has devastated the earth, and to restore to this betrayed, murderous knight the nobility and hope of salvation he long abandoned. <br /><br />As hell unleashes its wrath, and as the true nature of the girl is revealed, Thomas will find himself on a macabre battleground of angels and demons, saints, and the risen dead, and in the midst of a desperate struggle for nothing less than the soul of man."}},{"book":{"id":"30038654","title":"Home (Binti, #2)","numOfPages":"176","authors":"Nnedi Okorafor","imageUrl":"./images/30038654.jpg","link":"https://www.goodreads.com/book/show/30038654-home","publicationYear":"2017","averageRating":"4.23","ratingCount":"2838","description":"The thrilling sequel to the Nebula and Hugo winning <i>Binti</i>.<br /><br />It’s been a year since Binti and Okwu enrolled at Oomza University. A year since Binti was declared a hero for uniting two warring planets. A year since she left her family to pursue her dream.<br /><br />And now she must return home to her people, with her friend Okwu by her side, to face her family and face her elders.<br /><br />But Okwu will be the first of his race to set foot on Earth in over a hundred years, and the first ever to come in peace.<br /><br />After generations of conflict can human and Meduse ever learn to truly live in harmony?"}},{"book":{"id":"3428935","title":"The Warded Man (Demon Cycle, #1)","numOfPages":"416","authors":"Peter V. Brett","imageUrl":"./images/3428935.jpg","link":"https://www.goodreads.com/book/show/3428935-the-warded-man","publicationYear":"2009","averageRating":"4.27","ratingCount":"79919","description":"As darkness falls after sunset, the corelings rise—demons who possess supernatural powers and burn with a consuming hatred of humanity. For hundreds of years the demons have terrorized the night, slowly culling the human herd that shelters behind magical wards—symbols of power whose origins are lost in myth and whose protection is terrifyingly fragile. It was not always this way. Once, men and women battled the corelings on equal terms, but those days are gone. Night by night the demons grow stronger, while human numbers dwindle under their relentless assault. Now, with hope for the future fading, three young survivors of vicious demon attacks will dare the impossible, stepping beyond the crumbling safety of the wards to risk everything in a desperate quest to regain the secrets of the past. Together, they will stand against the night."}},{"book":{"id":"7235533","title":"The Way of Kings (The Stormlight Archive, #1)","numOfPages":"1007","authors":"Brandon Sanderson","imageUrl":"./images/7235533.jpg","link":"https://www.goodreads.com/book/show/7235533-the-way-of-kings","publicationYear":"2010","averageRating":"4.64","ratingCount":"170424","description":"Speak again the ancient oaths,<br /><i>Life before death.<br />Strength before weakness.<br />Journey before Destination.</i><br />And return to men the Shards they once bore.<br /><b>The Knights Radiant must stand again.</b><br /><br />Roshar is a world of stone swept by tempests that shape ecology and civilization. Animals and plants retract; cities are built in shelter. In centuries since ten orders of Knights fell, their Shardblade swords and Shardplate armor still transform men into near-invincible warriors. Wars are fought for them, and won by them.<br /><br />In one such war on the ruined Shattered Plains, slave Kaladin struggles to save his men and fathom leaders who deem them expendable, in senseless wars where ten armies fight separately against one foe. <br /><br />Brightlord Dalinar Kholin commands one of those other armies. Fascinated by the ancient text named<i>The Way of Kings</i> and troubled by visions of ancient times, he doubts his sanity.<br /><br />Across the ocean, Shallan trains under eminent scholar and notorious heretic, Dalinar’s niece Jasnah. Though Shallan genuinely loves learning, she plans a daring theft. Her research hints at secrets of the Knights Radiant and the true cause of the war."}},{"book":{"id":"68428","title":"The Final Empire (Mistborn, #1)","numOfPages":"541","authors":"Brandon Sanderson","imageUrl":"./images/68428.jpg","link":"https://www.goodreads.com/book/show/68428.The_Final_Empire","publicationYear":"2006","averageRating":"4.43","ratingCount":"245847","description":"In a world where ash falls from the sky, and mist dominates the night, an evil cloaks the land and stifles all life. The future of the empire rests on the shoulders of a troublemaker and his young apprentice. Together, can they fill the world with color once more?<br /><br />In Brandon Sanderson's intriguing tale of love, loss, despair and hope, a new kind of magic enters the stage — Allomancy, a magic of the metals."}},{"book":{"id":"26114291","title":"Ghost Talkers","numOfPages":"304","authors":"Mary Robinette Kowal","imageUrl":"./images/26114291.jpg","link":"https://www.goodreads.com/book/show/26114291-ghost-talkers","publicationYear":"2016","averageRating":"3.87","ratingCount":"2233","description":"Ginger Stuyvesant, an American heiress living in London during World War I, is engaged to Captain Benjamin Harford, an intelligence officer. Ginger is a medium for the Spirit Corps, a special Spiritualist force.<br /><br />Each soldier heading for the front is conditioned to report to the mediums of the Spirit Corps when they die so the Corps can pass instant information about troop movements to military intelligence.<br /><br />Ginger and her fellow mediums contribute a great deal to the war efforts, so long as they pass the information through appropriate channels. While Ben is away at the front, Ginger discovers the presence of a traitor. Without the presence of her fiance to validate her findings, the top brass thinks she's just imagining things. Even worse, it is clear that the Spirit Corps is now being directly targeted by the German war effort. Left to her own devices, Ginger has to find out how the Germans are targeting the Spirit Corps and stop them. This is a difficult and dangerous task for a woman of that era, but this time both the spirit and the flesh are willing…"}},{"book":{"id":"23601046","title":"The House of Shattered Wings (Dominion of the Fallen, #1)","numOfPages":"402","authors":"Aliette de Bodard","imageUrl":"./images/23601046.jpg","link":"https://www.goodreads.com/book/show/23601046-the-house-of-shattered-wings","publicationYear":"2015","averageRating":"3.39","ratingCount":"2151","description":"A superb murder mystery, on an epic scale, set against the fall out – literally – of a war in Heaven.<br /><br />Paris has survived the Great Houses War – just. Its streets are lined with haunted ruins, Notre-Dame is a burnt-out shell, and the Seine runs black with ashes and rubble. Yet life continues among the wreckage. The citizens continue to live, love, fight and survive in their war-torn city, and The Great Houses still vie for dominion over the once grand capital.<br /><br />House Silverspires, previously the leader of those power games, lies in disarray. Its magic is ailing; its founder, Morningstar, has been missing for decades; and now something from the shadows stalks its people inside their very own walls.<br /><br />Within the House, three very different people must come together: a naive but powerful Fallen, a alchemist with a self-destructive addiction, and a resentful young man wielding spells from the Far East. They may be Silverspires’ salvation. They may be the architects of its last, irreversible fall…"}},{"book":{"id":"208","title":"A Shadow in Summer (Long Price Quartet, #1)","numOfPages":"","authors":"Daniel Abraham","imageUrl":"./images/208.jpg","link":"https://www.goodreads.com/book/show/208.A_Shadow_in_Summer","publicationYear":"","averageRating":"3.59","ratingCount":"9404","description":"The city-state of Saraykeht dominates the Summer Cities. Its wealth is beyond measure; its port is open to all the merchants of the world, and its ruler, the Khai Saraykeht, commands forces to rival the Gods. Commerce and trade fill the streets with a hundred languages, and the coffers of the wealthy with jewels and gold. Any desire, however exotic or base, can be satisfied in its soft quarter. Blissfully ignorant of the forces that fuel their prosperity, the people live and work secure in the knowledge that their city is a bastion of progress in a harsh world. It would be a tragedy if it fell.<br /><br />Saraykeht is poised on the knife-edge of disaster.<br /><br />At the heart of the city's influence are the poet-sorcerer Heshai and the captive spirit, Seedless, whom he controls. For all his power, Heshai is weak, haunted by memories of shame and humiliation. A man faced with constant reminders of his responsibilities and his failures, he is the linchpin and the most vulnerable point in Saraykeht's greatness.<br /><br />Far to the west, the armies of Galt have conquered many lands. To take Saraykeht, they must first destroy the trade upon which its prosperity is based. Marchat Wilsin, head of Galt's trading house in the city, is planning a terrible crime against Heshai and Seedless. If he succeeds, Saraykeht will fall.<br /><br />Amat, House Wilsin's business manager, is a woman who rose from the slums to wield the power that Marchat Wilsin would use to destroy her city. Through accidents of fate and circumstance Amat, her apprentice Liat, and two young men from the farthest reaches of their society stand alone against the dangers that threaten the city."}},{"book":{"id":"3985","title":"The Amazing Adventures of Kavalier & Clay","numOfPages":"639","authors":"Michael Chabon","imageUrl":"./images/3985.jpg","link":"https://www.goodreads.com/book/show/3985.The_Amazing_Adventures_of_Kavalier_Clay","publicationYear":"","averageRating":"4.17","ratingCount":"158487","description":"Joe Kavalier, a young Jewish artist who has also been trained in the art of Houdini-esque escape, has just smuggled himself out of Nazi-invaded Prague and landed in New York City. His Brooklyn cousin Sammy Clay is looking for a partner to create heroes, stories, and art for the latest novelty to hit America - the comic book. Drawing on their own fears and dreams, Kavalier and Clay create the Escapist, the Monitor, and Luna Moth, inspired by the beautiful Rosa Saks, who will become linked by powerful ties to both men. With exhilarating style and grace, Michael Chabon tells an unforgettable story about American romance and possibility."}},{"book":{"id":"2179832","title":"Bright Shiny Morning","numOfPages":"501","authors":"James Frey","imageUrl":"./images/2179832.jpg","link":"https://www.goodreads.com/book/show/2179832.Bright_Shiny_Morning","publicationYear":"2008","averageRating":"3.80","ratingCount":"11876","description":"One of the most celebrated and controversial authors in America delivers his first novel—a sweeping chronicle of contemporary Los Angeles that is bold, exhilarating, and utterly original.<br /><br />Dozens of characters pass across the reader's sight lines—some never to be seen again—but James Frey lingers on a handful of LA's lost souls and captures the dramatic narrative of their lives: a bright, ambitious young Mexican-American woman who allows her future to be undone by a moment of searing humiliation; a supremely narcissistic action-movie star whose passion for the unattainable object of his affection nearly destroys him; a couple, both nineteen years old, who flee their suffocating hometown and struggle to survive on the fringes of the great city; and an aging Venice Beach alcoholic whose life is turned upside down when a meth-addled teenage girl shows up half-dead outside the restroom he calls home.<br /><br />Throughout this strikingly powerful novel there is the relentless drumbeat of the millions of other stories that, taken as a whole, describe a city, a culture, and an age. A dazzling tour de force, <i>Bright Shiny Morning</i> illuminates the joys, horrors, and unexpected fortunes of life and death in Los Angeles."}},{"book":{"id":"18770398","title":"Night Film","numOfPages":"640","authors":"Marisha Pessl","imageUrl":"./images/18770398.jpg","link":"https://www.goodreads.com/book/show/18770398-night-film","publicationYear":"2014","averageRating":"3.78","ratingCount":"56526","description":"Brilliant, haunting, breathtakingly suspenseful, Night Film is a superb literary thriller by the New York Times bestselling author of the blockbuster debut Special Topics in Calamity Physics.<br /><br />On a damp October night, the body of young, beautiful Ashley Cordova is found in an abandoned warehouse in lower Manhattan. By all appearances her death is a suicide - but investigative journalist Scott McGrath suspects otherwise. Though much has been written about the dark and unsettling films of Ashley's father, Stanislas Cordova, very little is known about the man himself. As McGrath pieces together the mystery of Ashley's death, he is drawn deeper and deeper into the dark underbelly of New York City and the twisted world of Stanislas Cordova, and he begins to wonder - is he the next victim? <br /><br />In this novel, the dazzlingly inventive writer Marisha Pessl offers a breathtaking mystery that will hold you in suspense until the last page is turned."}},{"book":{"id":"28763485","title":"The Sun Is Also a Star","numOfPages":"384","authors":"Nicola Yoon","imageUrl":"./images/28763485.jpg","link":"https://www.goodreads.com/book/show/28763485-the-sun-is-also-a-star","publicationYear":"2016","averageRating":"4.13","ratingCount":"52997","description":"Natasha: I’m a girl who believes in science and facts. Not fate. Not destiny. Or dreams that will never come true. I’m definitely not the kind of girl who meets a cute boy on a crowded New York City street and falls in love with him. Not when my family is twelve hours away from being deported to Jamaica. Falling in love with him won’t be my story.<br /><br />Daniel: I’ve always been the good son, the good student, living up to my parents’ high expectations. Never the poet. Or the dreamer. But when I see her, I forget about all that. Something about Natasha makes me think that fate has something much more extraordinary in store—for both of us.<br /><br />The Universe: Every moment in our lives has brought us to this single moment. A million futures lie before us. Which one will come true?"}},{"book":{"id":"153008","title":"Kushiel's Dart (Phèdre's Trilogy, #1)","numOfPages":"1015","authors":"Jacqueline Carey","imageUrl":"./images/153008.jpg","link":"https://www.goodreads.com/book/show/153008.Kushiel_s_Dart","publicationYear":"2003","averageRating":"4.04","ratingCount":"58118","description":"The land of Terre d'Ange is a place of unsurpassing beauty and grace. It is said that angels found the land and saw it was good... and the ensuing race that rose from the seed of angels and men live by one simple rule: Love as thou wilt. <br /><br />Phèdre nó Delaunay is a young woman who was born with a scarlet mote in her left eye. Sold into indentured servitude as a child, her bond is purchased by Anafiel Delaunay, a nobleman with very a special mission... and the first one to recognize who and what she is: one pricked by Kushiel's Dart, chosen to forever experience pain and pleasure as one.<br /><br />Phèdre is trained equally in the courtly arts and the talents of the bedchamber, but, above all, the ability to observe, remember, and analyze. Almost as talented a spy as she is courtesan, Phèdre stumbles upon a plot that threatens the very foundations of her homeland. Treachery sets her on her path; love and honor goad her further. And in the doing, it will take her to the edge of despair... and beyond. Hateful friend, loving enemy, beloved assassin; they can all wear the same glittering mask in this world, and Phèdre will get but one chance to save all that she holds dear. <br /><br />Set in a world of cunning poets, deadly courtiers, heroic traitors, and a truly Machiavellian villainess, this is a novel of grandeur, luxuriance, sacrifice, betrayal, and deeply laid conspiracies. Not since Dune has there been an epic on the scale of Kushiel's Dart-a massive tale about the violent death of an old age, and the birth of a new."}},{"book":{"id":"96281","title":"The Deed of Paksenarrion (The Deed of Paksenarrion, #1-3)","numOfPages":"1040","authors":"Elizabeth Moon","imageUrl":"./images/96281.jpg","link":"https://www.goodreads.com/book/show/96281.The_Deed_of_Paksenarrion","publicationYear":"1992","averageRating":"4.29","ratingCount":"10476","description":"<i>The Deed of Paksenarrion</i> revolves around the life of Paksenarrion Dorthansdotter, known as Paks. It takes place in a fictional medieval world comprised of kingdoms of humans, dwarves, and elves. The story begins by introducing Paks as a headstrong girl of 18, who leaves her home (fleeing a marriage arranged by her father) to join a mercenary company. Through her journeys and hardships she comes to realize that she has been gifted as a paladin. The novel was originally published in three volumes in 1988 and 1989 and as a single trade edition of that name in 1992. The three books included are <i>The Sheepfarmer's Daughter, Divided Allegiance</i> and <i>Oath of Gold.</i><br /><br />From publisher Baen: \"Paksenarrion, a simple sheepfarmer's daughter, yearns for a life of adventure and glory, such as was known to heroes in songs and story. At age seventeen she runs away from home to join a mercenary company and begins her epic life . . . Book One: Paks is trained as a mercenary, blooded, and introduced to the life of a soldier . . . and to the followers of Gird, the soldier's god. Book Two: Paks leaves the Duke's company to follow the path of Gird alone—and on her lonely quests encounters the other sentient races of her world. Book Three: Paks the warrior must learn to live with Paks the human. She undertakes a holy quest for a lost elven prince that brings the gods' wrath down on her and tests her very limits.\""}},{"book":{"id":"5129","title":"Brave New World","numOfPages":"268","authors":"Aldous Huxley","imageUrl":"./images/5129.jpg","link":"https://www.goodreads.com/book/show/5129.Brave_New_World","publicationYear":"1998","averageRating":"3.97","ratingCount":"1097278","description":"Far in the future, the World Controllers have created the ideal society. Through clever use of genetic engineering, brainwashing and recreational sex and drugs, all its members are happy consumers. Bernard Marx seems alone harbouring an ill-defined longing to break free. A visit to one of the few remaining Savage Reservations, where the old, imperfect life still continues, may be the cure for his distress...<br /><br />Huxley's ingenious fantasy of the future sheds a blazing light on the present and is considered to be his most enduring masterpiece."}},{"book":{"id":"9835731","title":"The Hypnotist (Joona Linna, #1)","numOfPages":"503","authors":"Lars Kepler","imageUrl":"./images/9835731.jpg","link":"https://www.goodreads.com/book/show/9835731-the-hypnotist","publicationYear":"","averageRating":"3.64","ratingCount":"31220","description":"<b>Prepare for <i>The Hypnotist</i> to cast its spell</b><br /><br />In the frigid clime of Tumba, Sweden, a gruesome triple homicide attracts the interest of Detective Inspector Joona Linna, who demands to investigate the murders. The killer is still at large, and there’s only one surviving witness—the boy whose family was killed before his eyes. Whoever committed the crimes wanted this boy to die: he’s suffered more than one hundred knife wounds and lapsed into a state of shock. Desperate for information, Linna sees only one option: hypnotism. He enlists Dr. Erik Maria Bark to mesmerize the boy, hoping to discover the killer through his eyes.<br /><br />It’s the sort of work that Bark has sworn he would never do again—ethically dubious and psychically scarring. When he breaks his promise and hypnotizes the victim, a long and terrifying chain of events begins to unfurl.<br /><br />An international sensation, <i>The Hypnotist</i> is set to appear in thirty-seven countries, and it has landed at the top of bestseller lists wherever it’s been published—in France, Holland, Germany, Spain, Italy, Denmark. Now it’s America’s turn. Combining the addictive power of the Stieg Larsson trilogy with the storytelling drive of <i>The Silence of the Lambs</i>, this adrenaline-drenched thriller is spellbinding from its very first page."}},{"book":{"id":"29936142","title":"The Path of Flames (Chronicles of the Black Gate, #1)","numOfPages":"","authors":"Phil Tucker","imageUrl":"./images/29936142.jpg","link":"https://www.goodreads.com/book/show/29936142-the-path-of-flames","publicationYear":"","averageRating":"4.12","ratingCount":"1161","description":"A war fueled by the dark powers of forbidden sorcery is about to engulf the Ascendant Empire. Agerastian heretics, armed with black fire and fueled by bitter hatred, seek to sever the ancient portals that unite the empire - and in so doing destroy it.<br /><br />Asho--a squire with a reviled past--sees his liege, the Lady Kyferin, and her meager forces banished to an infamous ruin. Beset by tragedy and betrayal, demons and an approaching army, the fate of the Kyferins hangs by the slenderest of threads. Asho realizes that their sole hope of survival may lie hidden within the depths of his scarred soul--a secret that could reverse their fortunes and reveal the truth behind the war that wracks their empire.<br /><br />Unpredictable, fast paced, and packed with unforgettable characters, The Path of Flames is the first installment in a gripping new epic fantasy series."}},{"book":{"id":"25126701","title":"The Wars of Light and Shadow Books 1-3 (Wars of Light & Shadow, #1-3; Arc 2 - The Ships of Merior, #1-2)","numOfPages":"2176","authors":"Janny Wurts","imageUrl":"./images/25126701.jpg","link":"https://www.goodreads.com/book/show/25126701-the-wars-of-light-and-shadow-books-1-3","publicationYear":"2016","averageRating":"4.64","ratingCount":"22","description":"The world of Athera lives in eternal fog, its skies obscured by the malevolent Mistwraith. Only the combined powers of two half-brothers can challenge the Mistwraith’s stranglehold: Arithon, Master of Shadow and Lysaer, Lord of Light.<br /><br />Arithon and Lysaer will find that they are inescapably bound inside a pattern of events dictated by their own deepest convictions. Yet there is more at stake than one battle with the Mistwraith – as the sorcerers of the Fellowship of Seven know well. For between them the half-brothers hold the balance of the world, its harmony and its future, in their hands.<br /><br /><b>Critical Praise</b><br /><br /><i>‘Astonishingly original and compelling… A gifted creator of wonder’<br />RAYMOND E. FEIST<br /><br />‘Janny Wurts builds beautiful castles in the air … where every detail is richly imagined and vividly rendered’<br />DIANA GABALDON<br /><br />‘It ought to be illegal for one person to have so much talent’<br />STEPHEN DONALDSON —</i>"}},{"book":{"id":"28660","title":"The Curse of the Mistwraith (Wars of Light and Shadow, #1)","numOfPages":"830","authors":"Janny Wurts","imageUrl":"./images/28660.jpg","link":"https://www.goodreads.com/book/show/28660.The_Curse_of_the_Mistwraith","publicationYear":"2009","averageRating":"3.74","ratingCount":"4467","description":"The stunning first volume in Janny Wurts’s epic tale of two half-brothers cursed to life-long enmity, now re-released with a striking new cover.<br /><br /><br />The world of Athera lives in eternal fog, its skies obscured by the malevolent Mistwraith. Only the combined powers of two half-brothers can challenge the Mistwraith’s stranglehold: Arithon, Master of Shadow and Lysaer, Lord of Light.<br /><br /><br />Arithon and Lysaer will find that they are inescapably bound inside a pattern of events dictated by their own deepest convictions. Yet there is more at stake than one battle with the Mistwraith – as the sorcerers of the Fellowship of Seven know well. For between them the half-brothers hold the balance of the world, its harmony and its future, in their hands."}},{"book":{"id":"25953369","title":"Hidden Figures: The American Dream and the Untold Story of the Black Women Mathematicians Who Helped Win the Space Race","numOfPages":"349","authors":"Margot Lee Shetterly","imageUrl":"./images/25953369.jpg","link":"https://www.goodreads.com/book/show/25953369-hidden-figures","publicationYear":"2016","averageRating":"3.92","ratingCount":"29810","description":"<blockquote>\n  <b>The phenomenal true story of the black female mathematicians at NASA whose calculations helped fuel some of America's greatest achievements in space.</b>\n</blockquote><i>Now a major motion picture starring Taraji P. Henson, Octavia Spencer, Janelle Monae, Kirsten Dunst, and Kevin Costner.</i><p>Before John Glenn orbited the Earth or Neil Armstrong walked on the moon, a group of dedicated female mathematicians known as \"human computers\" used pencils, slide rules, and adding machines to calculate the numbers that would launch rockets and astronauts into space.</p><p>Among these problem solvers were a group of exceptionally talented African American women, some of the brightest minds of their generation. Originally relegated to teaching math in the South's segregated public schools, they were called into service during the labor shortages of World War II, when America's aeronautics industry was in dire need of anyone who had the right stuff. Suddenly these overlooked math whizzes had shots at jobs worthy of their skills, and they answered Uncle Sam's call, moving to Hampton, Virginia, and the fascinating, high-energy world of the Langley Memorial Aeronautical Laboratory.</p><p>Even as Virginia's Jim Crow laws required them to be segregated from their white counterparts, the women of Langley's all-black West Computing group helped America achieve one of the things it desired most: a decisive victory over the Soviet Union in the Cold War and complete domination of the heavens.</p><p>Starting in World War II and moving through to the Cold War, the civil rights movement, and the space race, Hidden Figures follows the interwoven accounts of Dorothy Vaughan, Mary Jackson, Katherine Johnson, and Christine Darden, four African American women who participated in some of NASA's greatest successes. It chronicles their careers over nearly three decades as they faced challenges, forged alliances, and used their intellects to change their own lives - and their country's future.</p>"}},{"book":{"id":"29379042","title":"Poison City (Delphic Division, #1)","numOfPages":"352","authors":"Paul Crilley","imageUrl":"./images/29379042.jpg","link":"https://www.goodreads.com/book/show/29379042-poison-city","publicationYear":"2016","averageRating":"4.03","ratingCount":"206","description":"The name's Gideon Tau, but everyone just calls me London. I work for the Delphic Division, the occult investigative unit of the South African Police Service. My life revolves around two things - finding out who killed my daughter and imagining what I'm going to do to the bastard when I catch him.<br /><br />I have two friends. The first is my boss, Armitage, a fifty-something DCI from Yorkshire who looks more like someone's mother than a cop. Don't let that fool you. The second is the dog, my magical spirit guide. He talks, he watches TV all day, and he's a mean drunk.<br /><br />Life is pretty routine - I solve crimes, I search for my daughter's killer. Wash, rinse, repeat. Until the day I'm called out to the murder of a ramanga - a low-key vampire - basically, the tabloid journalist of the vampire world. It looks like an open and shut case. There's even CCTV footage of the killer.<br /><br />Except... the face on the CCTV footage? It's the face of the man who killed my daughter. I'm about to face a tough choice. Catch her killer or save the world? I can't do both.<br /><br />It's not looking good for the world.<br /><br />Poison City is the first in a fantastical new series for fans of Ben Aaronovitch, Lauren Beukes, Sarah Lotz and Stephen King."}},{"book":{"id":"30141401","title":"Idaho","numOfPages":"","authors":"Emily Ruskovich","imageUrl":"./images/30141401.jpg","link":"https://www.goodreads.com/book/show/30141401-idaho","publicationYear":"","averageRating":"3.50","ratingCount":"6143","description":"One hot August day a family drives to a mountain clearing to collect birch wood. Jenny, the mother, is in charge of lopping any small limbs off the logs with a hatchet. Wade, the father, does the stacking. The two daughters, June and May, aged nine and six, drink lemonade, swat away horseflies, bicker, and sing snatches of songs as they while away the time.<br /><br />But then something unimaginably shocking happens, an act so extreme it will scatter the family in every different direction.<br /><br />In a story told from multiple perspectives and in razor-sharp prose, we gradually learn more about this act, and the way its violence, love and memory reverberate through the life of every character in <i>Idaho</i>."}},{"book":{"id":"17554595","title":"Senlin Ascends (The Books of Babel, #1)","numOfPages":"","authors":"Josiah Bancroft","imageUrl":"./images/17554595.jpg","link":"https://www.goodreads.com/book/show/17554595-senlin-ascends","publicationYear":"","averageRating":"4.38","ratingCount":"1840","description":"Senlin, a mild-mannered school teacher, is drawn to the Tower of Babel by the grandiose promises of a guidebook. The ancient and immense Tower seems the perfect destination for a honeymoon. But soon after arriving, Senlin loses his young wife, Marya, in the crowd. <br /><br />Senlin’s search for Marya carries him through slums and theaters, prisons and ballrooms. He must survive betrayal, assassination, and the long guns of a flying fortress. But if he hopes to find Marya, Senlin will have to do more than survive. This quiet man of letters must become a man of action."}},{"book":{"id":"23287202","title":"Beyond Redemption (Manifest Delusions, #1)","numOfPages":"512","authors":"Michael R. Fletcher","imageUrl":"./images/23287202.jpg","link":"https://www.goodreads.com/book/show/23287202-beyond-redemption","publicationYear":"2015","averageRating":"4.02","ratingCount":"920","description":"Faith shapes the landscape, defines the laws of physics, and makes a mockery of truth. Common knowledge isn't an axiom, it's a force of nature. What the masses believe is. But insanity is a weapon, conviction a shield. Delusions give birth to foul new gods.<br /><br />Violent and dark, the world is filled with the Geisteskranken—men and women whose delusions manifest, twisting reality. High Priest Konig seeks to create order from chaos. He defines the beliefs of his followers, leading their faith to one end: a young boy, Morgen, must Ascend to become a god. A god they can control.<br /><br />But there are many who would see this would-be-god in their thrall, including the High Priest’s own Doppels, and a Slaver no one can resist. Three reprobates—The Greatest Swordsman in the World, a murderous Kleptic, and possibly the only sane man left—have their own nefarious plans for the young god.<br /><br />As these forces converge on the boy, there’s one more obstacle: time is running out. When one's delusions become more powerful, they become harder to control. The fate of the Geisteskranken is to inevitably find oneself in the Afterdeath. <br /><br />The question, then, is: Who will rule there?"}},{"book":{"id":"24800","title":"House of Leaves","numOfPages":"705","authors":"Mark Z. Danielewski","imageUrl":"./images/24800.jpg","link":"https://www.goodreads.com/book/show/24800.House_of_Leaves","publicationYear":"2000","averageRating":"4.13","ratingCount":"90621","description":"A blind old man, a young apprentice working in a tattoo shop, and a mad woman haunting an Ohio institute narrate this story of a family that encounters an endlessly shifting series of hallways in their new home, eventually coming face to face with the awful darkness lying at its heart."}},{"book":{"id":"28363972","title":"The Last Days of Night","numOfPages":"368","authors":"Graham Moore","imageUrl":"./images/28363972.jpg","link":"https://www.goodreads.com/book/show/28363972-the-last-days-of-night","publicationYear":"2016","averageRating":"4.13","ratingCount":"13101","description":"New York, 1888. Gas lamps still flicker in the city streets, but the miracle of electric light is in its infancy. The person who controls the means to turn night into day will make history--and a vast fortune. A young untested lawyer named Paul Cravath, fresh out of Columbia Law School, takes a case that seems impossible to win. Paul's client, George Westinghouse, has been sued by Thomas Edison over a billion-dollar question: Who invented the light bulb and holds the right to power the country? <br /><br />The case affords Paul entry to the heady world of high society--the glittering parties in Gramercy Park mansions, and the more insidious dealings done behind closed doors. The task facing him is beyond daunting. Edison is a wily, dangerous opponent with vast resources at his disposal--private spies, newspapers in his pocket, and the backing of J. P. Morgan himself. Yet this unknown lawyer shares with his famous adversary a compulsion to win at all costs. How will he do it?<br /><br />In obsessive pursuit of victory, Paul crosses paths with Nikola Tesla, an eccentric, brilliant inventor who may hold the key to defeating Edison, and with Agnes Huntington, a beautiful opera singer who proves to be a flawless performer on stage and off. As Paul takes greater and greater risks, he'll find that everyone in his path is playing their own game, and no one is quite who they seem."}},{"book":{"id":"1961496","title":"To Ride Hell’s Chasm","numOfPages":"681","authors":"Janny Wurts","imageUrl":"./images/1961496.jpg","link":"https://www.goodreads.com/book/show/1961496.To_Ride_Hell_s_Chasm","publicationYear":"2009","averageRating":"3.82","ratingCount":"1178","description":"An epic fantasy standalone novel from the author of the stunning <a href=\"https://www.goodreads.com/series/49113-wars-of-light-and-shadow\" rel=\"nofollow\">Wars of Light and Shadow</a> series.<br /><br />When Princess Anja fails to appear at her betrothal banquet, the tiny, peaceful kingdom of Sessalie is plunged into intrigue. Two warriors are charged with recovering the distraught king's beloved daughter. Taskin, Commander of the Royal Guard, whose icy competence and impressive life-term as the Crown's right-hand man command the kingdom's deep-seated respect; and Mykkael, the rough-hewn newcomer who has won the post of Captain of the Garrison – a scarred veteran with a deadly record of field warfare, whose 'interesting' background and foreign breeding are held in contempt by court society.<br /><br />As the princess's trail vanishes outside the citadel's gates, anxiety and tension escalate. Mykkael's investigations lead him to a radical explanation for the mystery, but he finds himself under suspicion from the court factions. Will Commander Taskin's famous fair-mindedness be enough to unravel the truth behind the garrison captain's dramatic theory: that the resourceful, high-spirited princess was not taken by force, but fled the palace to escape a demonic evil?"}},{"book":{"id":"11010251","title":"The Lost Wife","numOfPages":"","authors":"Alyson Richman","imageUrl":"./images/11010251.jpg","link":"https://www.goodreads.com/book/show/11010251-the-lost-wife","publicationYear":"","averageRating":"4.20","ratingCount":"36691","description":"<b>A rapturous novel of first love in a time of war-from the celebrated author of <i>The Rhythm of Memory </i>and <i>The Last Van Gogh</i>. </b><br /><br /> In pre-war Prague, the dreams of two young lovers are shattered when they are separated by the Nazi invasion. Then, decades later, thousands of miles away in New York, there's an inescapable glance of recognition between two strangers...<br /><br /> Providence is giving Lenka and Josef one more chance. From the glamorous ease of life in Prague before the Occupation, to the horrors of Nazi Europe, <i>The Lost Wife</i> explores the power of first love, the resilience of the human spirit- and the strength of memory.<br /><br /><br />"}},{"book":{"id":"26114545","title":"Too Like the Lightning (Terra Ignota, #1)","numOfPages":"432","authors":"Ada Palmer","imageUrl":"./images/26114545.jpg","link":"https://www.goodreads.com/book/show/26114545-too-like-the-lightning","publicationYear":"2016","averageRating":"3.88","ratingCount":"3497","description":"Mycroft Canner is a convict. For his crimes he is required, as is the custom of the 25th century, to wander the world being as useful as he can to all he meets. Carlyle Foster is a sensayer – a spiritual counselor in a world that has outlawed the public practice of religion, but which also knows that the inner lives of humans cannot be wished away.<br /><br />The world into which Mycroft and Carlyle have been born is as strange to our 21st-century eyes as ours would be to a native of the 1500s. It is a hard-won utopia built on technologically-generated abundance, and also on complex and mandatory systems of labelling all public writing and speech. What seem to us normal gender distinctions are now distinctly taboo in most social situations. And most of the world's population is affiliated with globe-girdling clans of the like-minded, whose endless economic and cultural competition is carefully managed by central planners of inestimable subtlety. To us it seems like a mad combination of heaven and hell. To them, it seems like normal life.<br /><br />And in this world, Mycroft and Carlyle have stumbled on the wild card that may destablize the system: the boy Bridger, who can effortlessly make his wishes come true. Who can, it would seem, bring inanimate objects to life..."}},{"book":{"id":"29430013","title":"The Trespasser (Dublin Murder Squad #6)","numOfPages":"449","authors":"Tana French","imageUrl":"./images/29430013.jpg","link":"https://www.goodreads.com/book/show/29430013-the-trespasser","publicationYear":"2016","averageRating":"3.97","ratingCount":"32242","description":"A new novel from the <i>New York Times</i> bestselling author.<br /><br /> Being on the Murder squad is nothing like Detective Antoinette Conway dreamed it would be. Her partner, Stephen Moran, is the only person who seems glad she’s there. The rest of her working life is a stream of thankless cases, vicious pranks, and harassment. Antoinette is savagely tough, but she’s getting close to the breaking point. <br />  <br /> Their new case looks like yet another by-the-numbers lovers’ quarrel gone bad. Aislinn Murray is blond, pretty, groomed to a shine, and dead in her catalogue-perfect living room, next to a table set for a romantic dinner. There’s nothing unusual about her—except that Antoinette’s seen her somewhere before.<br />  <br /> And that her death won’t stay in its neat by-numbers box. Other detectives are trying to push Antoinette and Steve into arresting Aislinn’s boyfriend, fast. There’s a shadowy figure at the end of Antoinette's road. Aislinn's friend is hinting that she knew Aislinn was in danger. And everything they find out about Aislinn takes her further from the glossy, passive doll she seemed to be.<br />  <br /> Antoinette knows the harassment has turned her paranoid, but she can’t tell just how far gone she is. Is this case another step in the campaign to force her off the squad, or are there darker currents flowing beneath its polished surface?"}},{"book":{"id":"16030654","title":"Queen of the Air: A True Story of Love and Tragedy at the Circus","numOfPages":"336","authors":"Dean Jensen","imageUrl":"./images/16030654.jpg","link":"https://www.goodreads.com/book/show/16030654-queen-of-the-air","publicationYear":"2013","averageRating":"3.66","ratingCount":"723","description":"A true life Water for Elephants, Queen of the Air brings the circus world to life through the gorgeously written, true story of renowned trapeze artist and circus performer Leitzel, Queen of the Air, the most famous woman in the world at the turn of the 20th century, and her star-crossed love affair with Alfredo Codona, of the famous Flying Codona Brothers.<br /><br />Like today's Beyonce, Madonna, and Cher, she was known to her vast public by just one name, Leitzel. There may have been some regions on earth where her name was not a household expression, but if so, they were likely on polar ice caps or in the darkest, deepest jungles.<br />       Leitzel was born into Dickensian circumstances, and became a princess and then a queen. She was not much bigger than a good size fairy, just four-foot-ten and less than 100 pounds. In the first part of the 20th century, she presided over a sawdust fiefdom of never-ending magic. She was the biggest star ever of the biggest circus ever, the Ringling Bros. and Barnum &amp; Bailey Circus, The Greatest Show on Earth. <br />    In her life, Leitzel had many suitors (and three husbands), but only one man ever fully captured her heart. He was the handsome Alfredo Codona, the greatest trapeze flyer that had ever lived, the only one in his time who, night after night, executed the deadliest of all big-top feats, The Triple--three somersaults in midair while traveling at 60 m.p.h. The Triple, the salto mortale, as the Italians called it, took the lives of more daredevils than any other circus stunt."}},{"book":{"id":"17404078","title":"The Disaster Artist: My Life Inside The Room, the Greatest Bad Movie Ever Made","numOfPages":"270","authors":"Greg Sestero","imageUrl":"./images/17404078.jpg","link":"https://www.goodreads.com/book/show/17404078-the-disaster-artist","publicationYear":"2013","averageRating":"4.40","ratingCount":"12071","description":"From the actor who lived through the most improbable Hollywood success story, with an award-winning narrative nonfiction writer, comes the inspiring, fascinating and laugh-out-loud story of a mysteriously wealthy outsider who sundered every road block in the Hollywood system to achieve success on his own terms—the making of <i>The Room</i>, “the <i>Citizen Kane</i> of bad movies” (Entertainment Weekly).<br /><br />In 2003, an independent film called <i>The Room</i>—written, produced, directed, and starring a very rich social misfit of indeterminate age and origin named Tommy Wiseau—made its disastrous debut in Los Angeles. Described by one reviewer as “like getting stabbed in the head,” the $6 million film earned a grand total of $1,800 at the box office and closed after two weeks. Now in its tenth anniversary year, <i>The Room</i> is an international phenomenon to rival <i>The Rocky Horror Picture Show</i>. Thousands of fans wait in line for hours to attend screenings complete with costumes, audience rituals, merchandising, and thousands of plastic spoons.<br /><br />Readers need not have seen <i>The Room</i> to appreciate its costar Greg Sestero’s account of how Tommy Wiseau defied every law of artistry, business, and interpersonal relationships to achieve the dream only he could love. While it does unravel mysteries for fans, <i>The Disaster Artist</i> is more than just an hilarious story about cinematic hubris: It is ultimately a surprisingly inspiring tour de force that reads like a page-turning novel, an open-hearted portrait of a supremely enigmatic man who will capture your heart."}},{"book":{"id":"12067","title":"Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch","numOfPages":"412","authors":"Terry Pratchett","imageUrl":"./images/12067.jpg","link":"https://www.goodreads.com/book/show/12067.Good_Omens","publicationYear":"2006","averageRating":"4.25","ratingCount":"334302","description":"<i>An alternative cover for this ISBN can be found <a href=\"https://www.goodreads.com/book/show/13418329-good-omens\" rel=\"nofollow\">here</a></i><br /><br />According to <i>The Nice and Accurate Prophecies of Agnes Nutter</i>, <i>Witch</i> (the world's only <i>completely</i> accurate book of prophecies, written in 1655, before she exploded), the world will end on a Saturday. Next Saturday, in fact. Just before dinner.<br /><br />So the armies of Good and Evil are amassing, Atlantis is rising, frogs are falling, tempers are flaring. Everything appears to be going according to Divine Plan. Except a somewhat fussy angel and a fast-living demon—both of whom have lived amongst Earth's mortals since The Beginning and have grown rather fond of the lifestyle—are not actually looking forward to the coming Rapture.<br /><br />And someone seems to have misplaced the Antichrist . . . "}},{"book":{"id":"320","title":"One Hundred Years of Solitude","numOfPages":"457","authors":"Gabriel García Márquez","imageUrl":"./images/320.jpg","link":"https://www.goodreads.com/book/show/320.One_Hundred_Years_of_Solitude","publicationYear":"2003","averageRating":"4.04","ratingCount":"582990","description":"Probably Garcí­a Márquez finest and most famous work. <i>One Hundred Years of Solitude</i> tells the story of the rise and fall, birth and death of a mythical town of Macondo through the history of the Buendia family. Inventive, amusing, magnetic, sad, alive with unforgettable men and women, and with a truth and understanding that strike the soul. <i>One Hundred Years of Solitude</i> is a masterpiece of the art of fiction."}},{"book":{"id":"18114322","title":"The Grapes of Wrath","numOfPages":"479","authors":"John Steinbeck","imageUrl":"./images/18114322.jpg","link":"https://www.goodreads.com/book/show/18114322-the-grapes-of-wrath","publicationYear":"2014","averageRating":"3.93","ratingCount":"562843","description":"First published in 1939, Steinbeck’s Pulitzer Prize winning epic of the Great Depression chronicles the Dust Bowl migration of the 1930s and tells the story of one Oklahoma farm family, the Joads, driven from their homestead and forced to travel west to the promised land of California. Out of their trials and their repeated collisions against the hard realities of an America divided into haves and have-nots evolves a drama that is intensely human yet majestic in its scale and moral vision, elemental yet plainspoken, tragic but ultimately stirring in its human dignity.<br /><br /> A portrait of the conflict between the powerful and the powerless, of one man’s fierce reaction to injustice, and of one woman’s stoical strength, the novel captures the horrors of the Great Depression and probes the very nature of equality and justice in America.<br /><br /> Sensitive to fascist and communist criticism, Steinbeck insisted that \"The Battle Hymn of the Republic” be printed in its entirety in the first edition of the book—which takes its title from the first verse: He is trampling out the vintage where the grapes of wrath are stored.” As Don DeLillo has claimed, Steinbeck shaped a geography of conscience” with this novel where there is something at stake in every sentence.” Beyond that—for emotional urgency, evocative power, sustained impact, prophetic reach, and continued controversy—<i>The Grapes of Wrath </i>is perhaps the most American of American classics."}},{"book":{"id":"5849","title":"A House for Mr Biswas","numOfPages":"623","authors":"V.S. Naipaul","imageUrl":"./images/5849.jpg","link":"https://www.goodreads.com/book/show/5849.A_House_for_Mr_Biswas","publicationYear":"2003","averageRating":"3.82","ratingCount":"14779","description":"Mohun Biswas has spent his 46 years of life striving for independence. Shuttled from one residence to another after the drowning of his father, he yearns for a place he can call home. He marries into the Tulsi family, on whom he becomes dependent, but rebels and takes on a succession of occupations in a struggle to weaken their hold over him.\""}},{"book":{"id":"3692","title":"The Heart of the Matter","numOfPages":"272","authors":"Graham Greene","imageUrl":"./images/3692.jpg","link":"https://www.goodreads.com/book/show/3692.The_Heart_of_the_Matter","publicationYear":"2004","averageRating":"3.98","ratingCount":"21407","description":"Scobie is a highly principled officer in a war-torn West African state. When he is passed over for promotion he is forced to borrow money to send his despairing wife away on a holiday.<br /><br />In her absence he falls hopelessly in love with Helen, a young widow, and his life is transformed by the experience. With a duty to repay his debts and an inability to distinguish between love, pity, and responsibilty to others and to God, Scobie moves inexorably to his final damnation.<br /><br />The terrifying description of a man's awe of the Church and the ability to portray human motive and to convey such a depth of suffering make <i>The Heart of the Matter</i> one of Graham Greene's most enduring, tragic novels."}},{"book":{"id":"7144","title":"Crime and Punishment","numOfPages":"671","authors":"Fyodor Dostoyevsky","imageUrl":"./images/7144.jpg","link":"https://www.goodreads.com/book/show/7144.Crime_and_Punishment","publicationYear":"2002","averageRating":"4.19","ratingCount":"453368","description":"Through the story of the brilliant but conflicted young Raskolnikov and the murder he commits, Fyodor Dostoevsky explores the theme of redemption through suffering. <i>Crime and Punishment</i> put Dostoevsky at the forefront of Russian writers when it appeared in 1866 and is now one of the most famous and influential novels in world literature.<br /><br />The poverty-stricken Raskolnikov, a talented student, devises a theory about extraordinary men being above the law, since in their brilliance they think “new thoughts” and so contribute to society. He then sets out to prove his theory by murdering a vile, cynical old pawnbroker and her sister. The act brings Raskolnikov into contact with his own buried conscience and with two characters — the deeply religious Sonia, who has endured great suffering, and Porfiry, the intelligent and discerning official who is charged with investigating the murder — both of whom compel Raskolnikov to feel the split in his nature. Dostoevsky provides readers with a suspenseful, penetrating psychological analysis that goes beyond the crime — which in the course of the novel demands drastic punishment — to reveal something about the human condition: The more we intellectualize, the more imprisoned we become."}},{"book":{"id":"5470","title":"1984","numOfPages":"328","authors":"George Orwell","imageUrl":"./images/5470.jpg","link":"https://www.goodreads.com/book/show/5470.1984","publicationYear":"1950","averageRating":"4.14","ratingCount":"2105873","description":"The year 1984 has come and gone, but George Orwell's prophetic, nightmarish vision in 1949 of the world we were becoming is timelier than ever. <i>1984</i> is still the great modern classic of \"negative utopia\" -a startlingly original and haunting novel that creates an imaginary world that is completely convincing, from the first sentence to the last four words. No one can deny the novel's hold on the imaginations of whole generations, or the power of its admonitions -a power that seems to grow, not lessen, with the passage of time."}},{"book":{"id":"767171","title":"The Rise and Fall of the Third Reich: A History of Nazi Germany","numOfPages":"1614","authors":"William L. Shirer","imageUrl":"./images/767171.jpg","link":"https://www.goodreads.com/book/show/767171.The_Rise_and_Fall_of_the_Third_Reich","publicationYear":"1990","averageRating":"4.15","ratingCount":"70093","description":"Hitler boasted that The Third Reich would last a thousand years. It lasted only 12. But those 12 years contained some of the most catastrophic events Western civilization has ever known.<p>No other powerful empire ever bequeathed such mountains of evidence about its birth and destruction as the Third Reich. When the bitter war was over, and before the Nazis could destroy their files, the Allied demand for unconditional surrender produced an almost hour-by-hour record of the nightmare empire built by Adolph Hitler. This record included the testimony of Nazi leaders and of concentration camp inmates, the diaries of officials, transcripts of secret conferences, army orders, private letters—all the vast paperwork behind Hitler's drive to conquer the world.</p><p>The famed foreign correspondent and historian William L. Shirer, who had watched and reported on the Nazis since 1925, spent five and a half years sifting through this massive documentation. The result is a monumental study that has been widely acclaimed as the definitive record of one of the most frightening chapters in the history of mankind.</p><p>This worldwide bestseller has been acclaimed as the definitive book on Nazi Germany; it is a classic work.</p><p>The accounts of how the United States got involved and how Hitler used Mussolini and Japan are astonishing, and the coverage of the war-from Germany's early successes to her eventual defeat-is must reading</p>"}},{"book":{"id":"127455","title":"The Lies of Locke Lamora (Gentleman Bastard, #1)","numOfPages":"499","authors":"Scott Lynch","imageUrl":"./images/127455.jpg","link":"https://www.goodreads.com/book/show/127455.The_Lies_of_Locke_Lamora","publicationYear":"2006","averageRating":"4.30","ratingCount":"142224","description":"In this stunning debut, author Scott Lynch delivers the wonderfully thrilling tale of an audacious criminal and his band of confidence tricksters. Set in a fantastic city pulsing with the lives of decadent nobles and daring thieves, here is a story of adventure, loyalty, and survival that is one part \"Robin Hood\", one part Ocean's Eleven, and entirely enthralling... <br /><br />An orphan's life is harsh — and often short — in the island city of Camorr, built on the ruins of a mysterious alien race. But born with a quick wit and a gift for thieving, Locke Lamora has dodged both death and slavery, only to fall into the hands of an eyeless priest known as Chains — a man who is neither blind nor a priest.<br /><br />A con artist of extraordinary talent, Chains passes his skills on to his carefully selected \"family\" of orphans — a group known as the Gentlemen Bastards. Under his tutelage, Locke grows to lead the Bastards, delightedly pulling off one outrageous confidence game after another. Soon he is infamous as the Thorn of Camorr, and no wealthy noble is safe from his sting.<br /><br />Passing themselves off as petty thieves, the brilliant Locke and his tightly knit band of light-fingered brothers have fooled even the criminal underworld's most feared ruler, Capa Barsavi. But there is someone in the shadows more powerful — and more ambitious — than Locke has yet imagined. <br /><br />Known as the Gray King, he is slowly killing Capa Barsavi's most trusted men — and using Locke as a pawn in his plot to take control of Camorr's underworld. With a bloody coup under way threatening to destroy everyone and everything that holds meaning in his mercenary life, Locke vows to beat the Gray King at his own brutal game — or die trying...<br /><br />"}}]}}}